Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x275 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xabdce): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xb79ef): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x41e2f): D:/THHTN/bai1/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 12 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xf2f7): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5544c): long long int
 <1><3f>: Abbrev Number: 1 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0xc3357): long double
 <1><46>: Abbrev Number: 1 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x5d65a): signed char
 <1><4d>: Abbrev Number: 3 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x367aa): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 1 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0xb3733): unsigned char
 <1><60>: Abbrev Number: 1 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x8a3fc): short int
 <1><67>: Abbrev Number: 3 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x97a49): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 1 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0xb214a): short unsigned int
 <1><7a>: Abbrev Number: 1 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xfb95): long int
 <1><81>: Abbrev Number: 3 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x7673c): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 1 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x47a31): long unsigned int
 <1><94>: Abbrev Number: 1 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x277bb): long long unsigned int
 <1><9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x367ac): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x87666): uint16_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x86dd8): uint32_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 48
    <ba>   DW_AT_decl_column : 20
    <bb>   DW_AT_type        : <0x81>
 <1><bf>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <c0>   DW_AT_byte_size   : 4
 <1><c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x66a93): StackType_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 24
    <c9>   DW_AT_type        : <0xb3>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x14b2): UBaseType_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 57
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x668f2): TickType_t
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 63
    <e0>   DW_AT_decl_column : 19
    <e1>   DW_AT_type        : <0xb3>
 <1><e5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <e6>   DW_AT_name        : (indirect string, offset: 0x9b48e): xSTATIC_LIST_ITEM
    <ea>   DW_AT_byte_size   : 20
    <eb>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 1061
    <ed>   DW_AT_decl_column : 8
    <ee>   DW_AT_sibling     : <0x10d>
 <2><f2>: Abbrev Number: 2 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0xc0a6a): xDummy2
    <f7>   DW_AT_decl_file   : 5
    <f7>   DW_AT_decl_line   : 1066
    <f9>   DW_AT_decl_column : 13
    <fa>   DW_AT_type        : <0xd9>
    <fe>   DW_AT_data_member_location: 0
 <2><ff>: Abbrev Number: 2 (DW_TAG_member)
    <100>   DW_AT_name        : (indirect string, offset: 0x4394c): pvDummy3
    <104>   DW_AT_decl_file   : 5
    <104>   DW_AT_decl_line   : 1067
    <106>   DW_AT_decl_column : 8
    <107>   DW_AT_type        : <0x10d>
    <10b>   DW_AT_data_member_location: 4
 <2><10c>: Abbrev Number: 0
 <1><10d>: Abbrev Number: 4 (DW_TAG_array_type)
    <10e>   DW_AT_type        : <0xbf>
    <112>   DW_AT_sibling     : <0x11d>
 <2><116>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <117>   DW_AT_type        : <0x31>
    <11b>   DW_AT_upper_bound : 3
 <2><11c>: Abbrev Number: 0
 <1><11d>: Abbrev Number: 9 (DW_TAG_typedef)
    <11e>   DW_AT_name        : (indirect string, offset: 0x8c453): StaticListItem_t
    <122>   DW_AT_decl_file   : 5
    <122>   DW_AT_decl_line   : 1072
    <124>   DW_AT_decl_column : 34
    <125>   DW_AT_type        : <0xe5>
 <1><129>: Abbrev Number: 8 (DW_TAG_structure_type)
    <12a>   DW_AT_name        : (indirect string, offset: 0x6a709): xSTATIC_TCB
    <12e>   DW_AT_byte_size   : 84
    <12f>   DW_AT_decl_file   : 5
    <12f>   DW_AT_decl_line   : 1112
    <131>   DW_AT_decl_column : 16
    <132>   DW_AT_sibling     : <0x1ac>
 <2><136>: Abbrev Number: 2 (DW_TAG_member)
    <137>   DW_AT_name        : (indirect string, offset: 0x26a2a): pxDummy1
    <13b>   DW_AT_decl_file   : 5
    <13b>   DW_AT_decl_line   : 1114
    <13d>   DW_AT_decl_column : 11
    <13e>   DW_AT_type        : <0xbf>
    <142>   DW_AT_data_member_location: 0
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x2431f): xDummy3
    <148>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 1118
    <14a>   DW_AT_decl_column : 19
    <14b>   DW_AT_type        : <0x1ac>
    <14f>   DW_AT_data_member_location: 4
 <2><150>: Abbrev Number: 2 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x1a5ac): uxDummy5
    <155>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 1119
    <157>   DW_AT_decl_column : 16
    <158>   DW_AT_type        : <0xcd>
    <15c>   DW_AT_data_member_location: 44
 <2><15d>: Abbrev Number: 2 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x26a6d): pxDummy6
    <162>   DW_AT_decl_file   : 5
    <162>   DW_AT_decl_line   : 1120
    <164>   DW_AT_decl_column : 11
    <165>   DW_AT_type        : <0xbf>
    <169>   DW_AT_data_member_location: 48
 <2><16a>: Abbrev Number: 2 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x424fd): ucDummy7
    <16f>   DW_AT_decl_file   : 5
    <16f>   DW_AT_decl_line   : 1121
    <171>   DW_AT_decl_column : 13
    <172>   DW_AT_type        : <0x1bc>
    <176>   DW_AT_data_member_location: 52
 <2><177>: Abbrev Number: 2 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x29b88): uxDummy12
    <17c>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 1132
    <17e>   DW_AT_decl_column : 16
    <17f>   DW_AT_type        : <0x1cc>
    <183>   DW_AT_data_member_location: 68
 <2><184>: Abbrev Number: 2 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0x1b8e2): ulDummy18
    <189>   DW_AT_decl_file   : 5
    <189>   DW_AT_decl_line   : 1147
    <18b>   DW_AT_decl_column : 14
    <18c>   DW_AT_type        : <0xb3>
    <190>   DW_AT_data_member_location: 76
 <2><191>: Abbrev Number: 2 (DW_TAG_member)
    <192>   DW_AT_name        : (indirect string, offset: 0xb6a1f): ucDummy19
    <196>   DW_AT_decl_file   : 5
    <196>   DW_AT_decl_line   : 1148
    <198>   DW_AT_decl_column : 13
    <199>   DW_AT_type        : <0x9b>
    <19d>   DW_AT_data_member_location: 80
 <2><19e>: Abbrev Number: 2 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0xa812c): uxDummy20
    <1a3>   DW_AT_decl_file   : 5
    <1a3>   DW_AT_decl_line   : 1151
    <1a5>   DW_AT_decl_column : 13
    <1a6>   DW_AT_type        : <0x9b>
    <1aa>   DW_AT_data_member_location: 81
 <2><1ab>: Abbrev Number: 0
 <1><1ac>: Abbrev Number: 4 (DW_TAG_array_type)
    <1ad>   DW_AT_type        : <0x11d>
    <1b1>   DW_AT_sibling     : <0x1bc>
 <2><1b5>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1b6>   DW_AT_type        : <0x31>
    <1ba>   DW_AT_upper_bound : 1
 <2><1bb>: Abbrev Number: 0
 <1><1bc>: Abbrev Number: 4 (DW_TAG_array_type)
    <1bd>   DW_AT_type        : <0x9b>
    <1c1>   DW_AT_sibling     : <0x1cc>
 <2><1c5>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1c6>   DW_AT_type        : <0x31>
    <1ca>   DW_AT_upper_bound : 15
 <2><1cb>: Abbrev Number: 0
 <1><1cc>: Abbrev Number: 4 (DW_TAG_array_type)
    <1cd>   DW_AT_type        : <0xcd>
    <1d1>   DW_AT_sibling     : <0x1dc>
 <2><1d5>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1d6>   DW_AT_type        : <0x31>
    <1da>   DW_AT_upper_bound : 1
 <2><1db>: Abbrev Number: 0
 <1><1dc>: Abbrev Number: 9 (DW_TAG_typedef)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x5c1ed): StaticTask_t
    <1e1>   DW_AT_decl_file   : 5
    <1e1>   DW_AT_decl_line   : 1160
    <1e3>   DW_AT_decl_column : 3
    <1e4>   DW_AT_type        : <0x129>
 <1><1e8>: Abbrev Number: 1 (DW_TAG_base_type)
    <1e9>   DW_AT_byte_size   : 1
    <1ea>   DW_AT_encoding    : 8	(unsigned char)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x3cb06): char
 <1><1ef>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1f0>   DW_AT_byte_size   : 4
    <1f0>   DW_AT_type        : <0xc1>
 <1><1f4>: Abbrev Number: 10 (DW_TAG_variable)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x624d6): xIdleTaskTCBBuffer
    <1f9>   DW_AT_decl_file   : 1
    <1f9>   DW_AT_decl_line   : 59
    <1fa>   DW_AT_decl_column : 21
    <1fb>   DW_AT_type        : <0x1dc>
    <1ff>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><205>: Abbrev Number: 4 (DW_TAG_array_type)
    <206>   DW_AT_type        : <0xc1>
    <20a>   DW_AT_sibling     : <0x215>
 <2><20e>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <20f>   DW_AT_type        : <0x31>
    <213>   DW_AT_upper_bound : 127
 <2><214>: Abbrev Number: 0
 <1><215>: Abbrev Number: 10 (DW_TAG_variable)
    <216>   DW_AT_name        : (indirect string, offset: 0x38d48): xIdleStack
    <21a>   DW_AT_decl_file   : 1
    <21a>   DW_AT_decl_line   : 60
    <21b>   DW_AT_decl_column : 20
    <21c>   DW_AT_type        : <0x205>
    <220>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><226>: Abbrev Number: 14 (DW_TAG_subprogram)
    <227>   DW_AT_external    : 1
    <227>   DW_AT_name        : (indirect string, offset: 0x851a5): vApplicationGetIdleTaskMemory
    <22b>   DW_AT_decl_file   : 1
    <22c>   DW_AT_decl_line   : 62
    <22d>   DW_AT_decl_column : 6
    <22e>   DW_AT_prototyped  : 1
    <22e>   DW_AT_low_pc      : 0x80004cc
    <232>   DW_AT_high_pc     : 0x34
    <236>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <238>   DW_AT_call_all_calls: 1
    <238>   DW_AT_sibling     : <0x264>
 <2><23c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <23d>   DW_AT_name        : (indirect string, offset: 0x624d4): ppxIdleTaskTCBBuffer
    <241>   DW_AT_decl_file   : 1
    <241>   DW_AT_decl_line   : 62
    <241>   DW_AT_decl_column : 52
    <242>   DW_AT_type        : <0x264>
    <246>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><249>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <24a>   DW_AT_name        : (indirect string, offset: 0x6ba75): ppxIdleTaskStackBuffer
    <24e>   DW_AT_decl_file   : 1
    <24e>   DW_AT_decl_line   : 62
    <24e>   DW_AT_decl_column : 88
    <24f>   DW_AT_type        : <0x26e>
    <253>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><256>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <257>   DW_AT_name        : (indirect string, offset: 0x65f1f): pulIdleTaskStackSize
    <25b>   DW_AT_decl_file   : 1
    <25b>   DW_AT_decl_line   : 62
    <25b>   DW_AT_decl_column : 122
    <25c>   DW_AT_type        : <0x273>
    <260>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><263>: Abbrev Number: 0
 <1><264>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <265>   DW_AT_byte_size   : 4
    <265>   DW_AT_type        : <0x269>
 <1><269>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26a>   DW_AT_byte_size   : 4
    <26a>   DW_AT_type        : <0x1dc>
 <1><26e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26f>   DW_AT_byte_size   : 4
    <26f>   DW_AT_type        : <0x1ef>
 <1><273>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <274>   DW_AT_byte_size   : 4
    <274>   DW_AT_type        : <0xb3>
 <1><278>: Abbrev Number: 0
  Compilation Unit @ offset 0x279:
   Length:        0x10dd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xd2
   Pointer Size:  4
 <0><285>: Abbrev Number: 30 (DW_TAG_compile_unit)
    <286>   DW_AT_producer    : (indirect string, offset: 0xabdce): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <28a>   DW_AT_language    : 29	(C11)
    <28b>   DW_AT_name        : (indirect string, offset: 0xbd085): ../Core/Src/main.c
    <28f>   DW_AT_comp_dir    : (indirect string, offset: 0x41e2f): D:/THHTN/bai1/Debug
    <293>   DW_AT_ranges      : 0x1f
    <297>   DW_AT_low_pc      : 0x0
    <29b>   DW_AT_stmt_list   : 0x82d
    <29f>   DW_AT_macros      : 0x1d781
 <1><2a3>: Abbrev Number: 10 (DW_TAG_base_type)
    <2a4>   DW_AT_byte_size   : 1
    <2a5>   DW_AT_encoding    : 6	(signed char)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x5d65a): signed char
 <1><2aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x367aa): __uint8_t
    <2af>   DW_AT_decl_file   : 3
    <2b0>   DW_AT_decl_line   : 43
    <2b1>   DW_AT_decl_column : 24
    <2b2>   DW_AT_type        : <0x2b6>
 <1><2b6>: Abbrev Number: 10 (DW_TAG_base_type)
    <2b7>   DW_AT_byte_size   : 1
    <2b8>   DW_AT_encoding    : 8	(unsigned char)
    <2b9>   DW_AT_name        : (indirect string, offset: 0xb3733): unsigned char
 <1><2bd>: Abbrev Number: 10 (DW_TAG_base_type)
    <2be>   DW_AT_byte_size   : 2
    <2bf>   DW_AT_encoding    : 5	(signed)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x8a3fc): short int
 <1><2c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x97a49): __uint16_t
    <2c9>   DW_AT_decl_file   : 3
    <2ca>   DW_AT_decl_line   : 57
    <2cb>   DW_AT_decl_column : 25
    <2cc>   DW_AT_type        : <0x2d0>
 <1><2d0>: Abbrev Number: 10 (DW_TAG_base_type)
    <2d1>   DW_AT_byte_size   : 2
    <2d2>   DW_AT_encoding    : 7	(unsigned)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xb214a): short unsigned int
 <1><2d7>: Abbrev Number: 10 (DW_TAG_base_type)
    <2d8>   DW_AT_byte_size   : 4
    <2d9>   DW_AT_encoding    : 5	(signed)
    <2da>   DW_AT_name        : (indirect string, offset: 0xfb95): long int
 <1><2de>: Abbrev Number: 4 (DW_TAG_typedef)
    <2df>   DW_AT_name        : (indirect string, offset: 0x7673c): __uint32_t
    <2e3>   DW_AT_decl_file   : 3
    <2e4>   DW_AT_decl_line   : 79
    <2e5>   DW_AT_decl_column : 25
    <2e6>   DW_AT_type        : <0x2ea>
 <1><2ea>: Abbrev Number: 10 (DW_TAG_base_type)
    <2eb>   DW_AT_byte_size   : 4
    <2ec>   DW_AT_encoding    : 7	(unsigned)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x47a31): long unsigned int
 <1><2f1>: Abbrev Number: 10 (DW_TAG_base_type)
    <2f2>   DW_AT_byte_size   : 8
    <2f3>   DW_AT_encoding    : 5	(signed)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x5544c): long long int
 <1><2f8>: Abbrev Number: 10 (DW_TAG_base_type)
    <2f9>   DW_AT_byte_size   : 8
    <2fa>   DW_AT_encoding    : 7	(unsigned)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x277bb): long long unsigned int
 <1><2ff>: Abbrev Number: 31 (DW_TAG_base_type)
    <300>   DW_AT_byte_size   : 4
    <301>   DW_AT_encoding    : 5	(signed)
    <302>   DW_AT_name        : int
 <1><306>: Abbrev Number: 10 (DW_TAG_base_type)
    <307>   DW_AT_byte_size   : 4
    <308>   DW_AT_encoding    : 7	(unsigned)
    <309>   DW_AT_name        : (indirect string, offset: 0xf2f7): unsigned int
 <1><30d>: Abbrev Number: 4 (DW_TAG_typedef)
    <30e>   DW_AT_name        : (indirect string, offset: 0x367ac): uint8_t
    <312>   DW_AT_decl_file   : 4
    <313>   DW_AT_decl_line   : 24
    <314>   DW_AT_decl_column : 19
    <315>   DW_AT_type        : <0x2aa>
 <1><319>: Abbrev Number: 4 (DW_TAG_typedef)
    <31a>   DW_AT_name        : (indirect string, offset: 0x87666): uint16_t
    <31e>   DW_AT_decl_file   : 4
    <31f>   DW_AT_decl_line   : 36
    <320>   DW_AT_decl_column : 20
    <321>   DW_AT_type        : <0x2c4>
 <1><325>: Abbrev Number: 4 (DW_TAG_typedef)
    <326>   DW_AT_name        : (indirect string, offset: 0x86dd8): uint32_t
    <32a>   DW_AT_decl_file   : 4
    <32b>   DW_AT_decl_line   : 48
    <32c>   DW_AT_decl_column : 20
    <32d>   DW_AT_type        : <0x2de>
 <1><331>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <332>   DW_AT_type        : <0x325>
 <1><336>: Abbrev Number: 11 (DW_TAG_array_type)
    <337>   DW_AT_type        : <0x325>
    <33b>   DW_AT_sibling     : <0x346>
 <2><33f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <340>   DW_AT_type        : <0x306>
    <344>   DW_AT_upper_bound : 1
 <2><345>: Abbrev Number: 0
 <1><346>: Abbrev Number: 14 (DW_TAG_structure_type)
    <347>   DW_AT_byte_size   : 24
    <348>   DW_AT_decl_file   : 5
    <349>   DW_AT_decl_line   : 324
    <34b>   DW_AT_decl_column : 9
    <34b>   DW_AT_sibling     : <0x39d>
 <2><34f>: Abbrev Number: 5 (DW_TAG_member)
    <350>   DW_AT_name        : CR
    <353>   DW_AT_decl_file   : 5
    <353>   DW_AT_decl_line   : 326
    <355>   DW_AT_decl_column : 17
    <355>   DW_AT_type        : <0x331>
    <359>   DW_AT_data_member_location: 0
 <2><35a>: Abbrev Number: 1 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0xbad10): NDTR
    <35f>   DW_AT_decl_file   : 5
    <360>   DW_AT_decl_line   : 327
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x331>
    <367>   DW_AT_data_member_location: 4
 <2><368>: Abbrev Number: 5 (DW_TAG_member)
    <369>   DW_AT_name        : PAR
    <36d>   DW_AT_decl_file   : 5
    <36d>   DW_AT_decl_line   : 328
    <36f>   DW_AT_decl_column : 17
    <36f>   DW_AT_type        : <0x331>
    <373>   DW_AT_data_member_location: 8
 <2><374>: Abbrev Number: 1 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0xbb801): M0AR
    <379>   DW_AT_decl_file   : 5
    <37a>   DW_AT_decl_line   : 329
    <37c>   DW_AT_decl_column : 17
    <37d>   DW_AT_type        : <0x331>
    <381>   DW_AT_data_member_location: 12
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0xbbf00): M1AR
    <387>   DW_AT_decl_file   : 5
    <388>   DW_AT_decl_line   : 330
    <38a>   DW_AT_decl_column : 17
    <38b>   DW_AT_type        : <0x331>
    <38f>   DW_AT_data_member_location: 16
 <2><390>: Abbrev Number: 5 (DW_TAG_member)
    <391>   DW_AT_name        : FCR
    <395>   DW_AT_decl_file   : 5
    <395>   DW_AT_decl_line   : 331
    <397>   DW_AT_decl_column : 17
    <397>   DW_AT_type        : <0x331>
    <39b>   DW_AT_data_member_location: 20
 <2><39c>: Abbrev Number: 0
 <1><39d>: Abbrev Number: 8 (DW_TAG_typedef)
    <39e>   DW_AT_name        : (indirect string, offset: 0xbd0d9): DMA_Stream_TypeDef
    <3a2>   DW_AT_decl_file   : 5
    <3a3>   DW_AT_decl_line   : 332
    <3a5>   DW_AT_decl_column : 3
    <3a6>   DW_AT_type        : <0x346>
 <1><3aa>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3ab>   DW_AT_byte_size   : 40
    <3ac>   DW_AT_decl_file   : 5
    <3ad>   DW_AT_decl_line   : 430
    <3af>   DW_AT_decl_column : 9
    <3af>   DW_AT_sibling     : <0x42c>
 <2><3b3>: Abbrev Number: 1 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0xbc5cd): MODER
    <3b8>   DW_AT_decl_file   : 5
    <3b9>   DW_AT_decl_line   : 432
    <3bb>   DW_AT_decl_column : 17
    <3bc>   DW_AT_type        : <0x331>
    <3c0>   DW_AT_data_member_location: 0
 <2><3c1>: Abbrev Number: 1 (DW_TAG_member)
    <3c2>   DW_AT_name        : (indirect string, offset: 0xbc9f7): OTYPER
    <3c6>   DW_AT_decl_file   : 5
    <3c7>   DW_AT_decl_line   : 433
    <3c9>   DW_AT_decl_column : 17
    <3ca>   DW_AT_type        : <0x331>
    <3ce>   DW_AT_data_member_location: 4
 <2><3cf>: Abbrev Number: 1 (DW_TAG_member)
    <3d0>   DW_AT_name        : (indirect string, offset: 0xbcfad): OSPEEDR
    <3d4>   DW_AT_decl_file   : 5
    <3d5>   DW_AT_decl_line   : 434
    <3d7>   DW_AT_decl_column : 17
    <3d8>   DW_AT_type        : <0x331>
    <3dc>   DW_AT_data_member_location: 8
 <2><3dd>: Abbrev Number: 1 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0xbc158): PUPDR
    <3e2>   DW_AT_decl_file   : 5
    <3e3>   DW_AT_decl_line   : 435
    <3e5>   DW_AT_decl_column : 17
    <3e6>   DW_AT_type        : <0x331>
    <3ea>   DW_AT_data_member_location: 12
 <2><3eb>: Abbrev Number: 5 (DW_TAG_member)
    <3ec>   DW_AT_name        : IDR
    <3f0>   DW_AT_decl_file   : 5
    <3f0>   DW_AT_decl_line   : 436
    <3f2>   DW_AT_decl_column : 17
    <3f2>   DW_AT_type        : <0x331>
    <3f6>   DW_AT_data_member_location: 16
 <2><3f7>: Abbrev Number: 5 (DW_TAG_member)
    <3f8>   DW_AT_name        : ODR
    <3fc>   DW_AT_decl_file   : 5
    <3fc>   DW_AT_decl_line   : 437
    <3fe>   DW_AT_decl_column : 17
    <3fe>   DW_AT_type        : <0x331>
    <402>   DW_AT_data_member_location: 20
 <2><403>: Abbrev Number: 1 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0xbb115): BSRR
    <408>   DW_AT_decl_file   : 5
    <409>   DW_AT_decl_line   : 438
    <40b>   DW_AT_decl_column : 17
    <40c>   DW_AT_type        : <0x331>
    <410>   DW_AT_data_member_location: 24
 <2><411>: Abbrev Number: 1 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0xbced1): LCKR
    <416>   DW_AT_decl_file   : 5
    <417>   DW_AT_decl_line   : 439
    <419>   DW_AT_decl_column : 17
    <41a>   DW_AT_type        : <0x331>
    <41e>   DW_AT_data_member_location: 28
 <2><41f>: Abbrev Number: 5 (DW_TAG_member)
    <420>   DW_AT_name        : AFR
    <424>   DW_AT_decl_file   : 5
    <424>   DW_AT_decl_line   : 440
    <426>   DW_AT_decl_column : 17
    <426>   DW_AT_type        : <0x43c>
    <42a>   DW_AT_data_member_location: 32
 <2><42b>: Abbrev Number: 0
 <1><42c>: Abbrev Number: 11 (DW_TAG_array_type)
    <42d>   DW_AT_type        : <0x331>
    <431>   DW_AT_sibling     : <0x43c>
 <2><435>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <436>   DW_AT_type        : <0x306>
    <43a>   DW_AT_upper_bound : 1
 <2><43b>: Abbrev Number: 0
 <1><43c>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <43d>   DW_AT_type        : <0x42c>
 <1><441>: Abbrev Number: 8 (DW_TAG_typedef)
    <442>   DW_AT_name        : (indirect string, offset: 0xbd44d): GPIO_TypeDef
    <446>   DW_AT_decl_file   : 5
    <447>   DW_AT_decl_line   : 441
    <449>   DW_AT_decl_column : 3
    <44a>   DW_AT_type        : <0x3aa>
 <1><44e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <44f>   DW_AT_byte_size   : 8
    <450>   DW_AT_decl_file   : 5
    <451>   DW_AT_decl_line   : 490
    <453>   DW_AT_decl_column : 9
    <453>   DW_AT_sibling     : <0x46f>
 <2><457>: Abbrev Number: 5 (DW_TAG_member)
    <458>   DW_AT_name        : CR
    <45b>   DW_AT_decl_file   : 5
    <45b>   DW_AT_decl_line   : 492
    <45d>   DW_AT_decl_column : 17
    <45d>   DW_AT_type        : <0x331>
    <461>   DW_AT_data_member_location: 0
 <2><462>: Abbrev Number: 5 (DW_TAG_member)
    <463>   DW_AT_name        : CSR
    <467>   DW_AT_decl_file   : 5
    <467>   DW_AT_decl_line   : 493
    <469>   DW_AT_decl_column : 17
    <469>   DW_AT_type        : <0x331>
    <46d>   DW_AT_data_member_location: 4
 <2><46e>: Abbrev Number: 0
 <1><46f>: Abbrev Number: 8 (DW_TAG_typedef)
    <470>   DW_AT_name        : (indirect string, offset: 0xbc8c2): PWR_TypeDef
    <474>   DW_AT_decl_file   : 5
    <475>   DW_AT_decl_line   : 494
    <477>   DW_AT_decl_column : 3
    <478>   DW_AT_type        : <0x44e>
 <1><47c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <47d>   DW_AT_byte_size   : 136
    <47e>   DW_AT_decl_file   : 5
    <47f>   DW_AT_decl_line   : 500
    <481>   DW_AT_decl_column : 9
    <481>   DW_AT_sibling     : <0x623>
 <2><485>: Abbrev Number: 5 (DW_TAG_member)
    <486>   DW_AT_name        : CR
    <489>   DW_AT_decl_file   : 5
    <489>   DW_AT_decl_line   : 502
    <48b>   DW_AT_decl_column : 17
    <48b>   DW_AT_type        : <0x331>
    <48f>   DW_AT_data_member_location: 0
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0xbc87b): PLLCFGR
    <495>   DW_AT_decl_file   : 5
    <496>   DW_AT_decl_line   : 503
    <498>   DW_AT_decl_column : 17
    <499>   DW_AT_type        : <0x331>
    <49d>   DW_AT_data_member_location: 4
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0xbc87e): CFGR
    <4a3>   DW_AT_decl_file   : 5
    <4a4>   DW_AT_decl_line   : 504
    <4a6>   DW_AT_decl_column : 17
    <4a7>   DW_AT_type        : <0x331>
    <4ab>   DW_AT_data_member_location: 8
 <2><4ac>: Abbrev Number: 5 (DW_TAG_member)
    <4ad>   DW_AT_name        : CIR
    <4b1>   DW_AT_decl_file   : 5
    <4b1>   DW_AT_decl_line   : 505
    <4b3>   DW_AT_decl_column : 17
    <4b3>   DW_AT_type        : <0x331>
    <4b7>   DW_AT_data_member_location: 12
 <2><4b8>: Abbrev Number: 1 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0xbcc0c): AHB1RSTR
    <4bd>   DW_AT_decl_file   : 5
    <4be>   DW_AT_decl_line   : 506
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x331>
    <4c5>   DW_AT_data_member_location: 16
 <2><4c6>: Abbrev Number: 1 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0xbacae): AHB2RSTR
    <4cb>   DW_AT_decl_file   : 5
    <4cc>   DW_AT_decl_line   : 507
    <4ce>   DW_AT_decl_column : 17
    <4cf>   DW_AT_type        : <0x331>
    <4d3>   DW_AT_data_member_location: 20
 <2><4d4>: Abbrev Number: 1 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xbb474): AHB3RSTR
    <4d9>   DW_AT_decl_file   : 5
    <4da>   DW_AT_decl_line   : 508
    <4dc>   DW_AT_decl_column : 17
    <4dd>   DW_AT_type        : <0x331>
    <4e1>   DW_AT_data_member_location: 24
 <2><4e2>: Abbrev Number: 1 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0xbd349): RESERVED0
    <4e7>   DW_AT_decl_file   : 5
    <4e8>   DW_AT_decl_line   : 509
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0x325>
    <4ef>   DW_AT_data_member_location: 28
 <2><4f0>: Abbrev Number: 1 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0xbaca5): APB1RSTR
    <4f5>   DW_AT_decl_file   : 5
    <4f6>   DW_AT_decl_line   : 510
    <4f8>   DW_AT_decl_column : 17
    <4f9>   DW_AT_type        : <0x331>
    <4fd>   DW_AT_data_member_location: 32
 <2><4fe>: Abbrev Number: 1 (DW_TAG_member)
    <4ff>   DW_AT_name        : (indirect string, offset: 0xbb900): APB2RSTR
    <503>   DW_AT_decl_file   : 5
    <504>   DW_AT_decl_line   : 511
    <506>   DW_AT_decl_column : 17
    <507>   DW_AT_type        : <0x331>
    <50b>   DW_AT_data_member_location: 36
 <2><50c>: Abbrev Number: 1 (DW_TAG_member)
    <50d>   DW_AT_name        : (indirect string, offset: 0xbd353): RESERVED1
    <511>   DW_AT_decl_file   : 5
    <512>   DW_AT_decl_line   : 512
    <514>   DW_AT_decl_column : 17
    <515>   DW_AT_type        : <0x336>
    <519>   DW_AT_data_member_location: 40
 <2><51a>: Abbrev Number: 1 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0xbac70): AHB1ENR
    <51f>   DW_AT_decl_file   : 5
    <520>   DW_AT_decl_line   : 513
    <522>   DW_AT_decl_column : 17
    <523>   DW_AT_type        : <0x331>
    <527>   DW_AT_data_member_location: 48
 <2><528>: Abbrev Number: 1 (DW_TAG_member)
    <529>   DW_AT_name        : (indirect string, offset: 0xbb1a4): AHB2ENR
    <52d>   DW_AT_decl_file   : 5
    <52e>   DW_AT_decl_line   : 514
    <530>   DW_AT_decl_column : 17
    <531>   DW_AT_type        : <0x331>
    <535>   DW_AT_data_member_location: 52
 <2><536>: Abbrev Number: 1 (DW_TAG_member)
    <537>   DW_AT_name        : (indirect string, offset: 0xbb932): AHB3ENR
    <53b>   DW_AT_decl_file   : 5
    <53c>   DW_AT_decl_line   : 515
    <53e>   DW_AT_decl_column : 17
    <53f>   DW_AT_type        : <0x331>
    <543>   DW_AT_data_member_location: 56
 <2><544>: Abbrev Number: 1 (DW_TAG_member)
    <545>   DW_AT_name        : (indirect string, offset: 0xbd35d): RESERVED2
    <549>   DW_AT_decl_file   : 5
    <54a>   DW_AT_decl_line   : 516
    <54c>   DW_AT_decl_column : 17
    <54d>   DW_AT_type        : <0x325>
    <551>   DW_AT_data_member_location: 60
 <2><552>: Abbrev Number: 1 (DW_TAG_member)
    <553>   DW_AT_name        : (indirect string, offset: 0xbc150): APB1ENR
    <557>   DW_AT_decl_file   : 5
    <558>   DW_AT_decl_line   : 517
    <55a>   DW_AT_decl_column : 17
    <55b>   DW_AT_type        : <0x331>
    <55f>   DW_AT_data_member_location: 64
 <2><560>: Abbrev Number: 1 (DW_TAG_member)
    <561>   DW_AT_name        : (indirect string, offset: 0xbbbac): APB2ENR
    <565>   DW_AT_decl_file   : 5
    <566>   DW_AT_decl_line   : 518
    <568>   DW_AT_decl_column : 17
    <569>   DW_AT_type        : <0x331>
    <56d>   DW_AT_data_member_location: 68
 <2><56e>: Abbrev Number: 1 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0xbd367): RESERVED3
    <573>   DW_AT_decl_file   : 5
    <574>   DW_AT_decl_line   : 519
    <576>   DW_AT_decl_column : 17
    <577>   DW_AT_type        : <0x336>
    <57b>   DW_AT_data_member_location: 72
 <2><57c>: Abbrev Number: 1 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0xbcca1): AHB1LPENR
    <581>   DW_AT_decl_file   : 5
    <582>   DW_AT_decl_line   : 520
    <584>   DW_AT_decl_column : 17
    <585>   DW_AT_type        : <0x331>
    <589>   DW_AT_data_member_location: 80
 <2><58a>: Abbrev Number: 1 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0xbb10b): AHB2LPENR
    <58f>   DW_AT_decl_file   : 5
    <590>   DW_AT_decl_line   : 521
    <592>   DW_AT_decl_column : 17
    <593>   DW_AT_type        : <0x331>
    <597>   DW_AT_data_member_location: 84
 <2><598>: Abbrev Number: 1 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0xbc64a): AHB3LPENR
    <59d>   DW_AT_decl_file   : 5
    <59e>   DW_AT_decl_line   : 522
    <5a0>   DW_AT_decl_column : 17
    <5a1>   DW_AT_type        : <0x331>
    <5a5>   DW_AT_data_member_location: 88
 <2><5a6>: Abbrev Number: 1 (DW_TAG_member)
    <5a7>   DW_AT_name        : (indirect string, offset: 0xbd371): RESERVED4
    <5ab>   DW_AT_decl_file   : 5
    <5ac>   DW_AT_decl_line   : 523
    <5ae>   DW_AT_decl_column : 17
    <5af>   DW_AT_type        : <0x325>
    <5b3>   DW_AT_data_member_location: 92
 <2><5b4>: Abbrev Number: 1 (DW_TAG_member)
    <5b5>   DW_AT_name        : (indirect string, offset: 0xbcde4): APB1LPENR
    <5b9>   DW_AT_decl_file   : 5
    <5ba>   DW_AT_decl_line   : 524
    <5bc>   DW_AT_decl_column : 17
    <5bd>   DW_AT_type        : <0x331>
    <5c1>   DW_AT_data_member_location: 96
 <2><5c2>: Abbrev Number: 1 (DW_TAG_member)
    <5c3>   DW_AT_name        : (indirect string, offset: 0xbb177): APB2LPENR
    <5c7>   DW_AT_decl_file   : 5
    <5c8>   DW_AT_decl_line   : 525
    <5ca>   DW_AT_decl_column : 17
    <5cb>   DW_AT_type        : <0x331>
    <5cf>   DW_AT_data_member_location: 100
 <2><5d0>: Abbrev Number: 1 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0xbd37b): RESERVED5
    <5d5>   DW_AT_decl_file   : 5
    <5d6>   DW_AT_decl_line   : 526
    <5d8>   DW_AT_decl_column : 17
    <5d9>   DW_AT_type        : <0x336>
    <5dd>   DW_AT_data_member_location: 104
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0xbae0e): BDCR
    <5e3>   DW_AT_decl_file   : 5
    <5e4>   DW_AT_decl_line   : 527
    <5e6>   DW_AT_decl_column : 17
    <5e7>   DW_AT_type        : <0x331>
    <5eb>   DW_AT_data_member_location: 112
 <2><5ec>: Abbrev Number: 5 (DW_TAG_member)
    <5ed>   DW_AT_name        : CSR
    <5f1>   DW_AT_decl_file   : 5
    <5f1>   DW_AT_decl_line   : 528
    <5f3>   DW_AT_decl_column : 17
    <5f3>   DW_AT_type        : <0x331>
    <5f7>   DW_AT_data_member_location: 116
 <2><5f8>: Abbrev Number: 1 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0xbc1d7): RESERVED6
    <5fd>   DW_AT_decl_file   : 5
    <5fe>   DW_AT_decl_line   : 529
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0x336>
    <605>   DW_AT_data_member_location: 120
 <2><606>: Abbrev Number: 1 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0xbbc75): SSCGR
    <60b>   DW_AT_decl_file   : 5
    <60c>   DW_AT_decl_line   : 530
    <60e>   DW_AT_decl_column : 17
    <60f>   DW_AT_type        : <0x331>
    <613>   DW_AT_data_member_location: 128
 <2><614>: Abbrev Number: 1 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0xbb47d): PLLI2SCFGR
    <619>   DW_AT_decl_file   : 5
    <61a>   DW_AT_decl_line   : 531
    <61c>   DW_AT_decl_column : 17
    <61d>   DW_AT_type        : <0x331>
    <621>   DW_AT_data_member_location: 132
 <2><622>: Abbrev Number: 0
 <1><623>: Abbrev Number: 8 (DW_TAG_typedef)
    <624>   DW_AT_name        : (indirect string, offset: 0xbb993): RCC_TypeDef
    <628>   DW_AT_decl_file   : 5
    <629>   DW_AT_decl_line   : 532
    <62b>   DW_AT_decl_column : 3
    <62c>   DW_AT_type        : <0x47c>
 <1><630>: Abbrev Number: 14 (DW_TAG_structure_type)
    <631>   DW_AT_byte_size   : 84
    <632>   DW_AT_decl_file   : 5
    <633>   DW_AT_decl_line   : 632
    <635>   DW_AT_decl_column : 9
    <635>   DW_AT_sibling     : <0x74a>
 <2><639>: Abbrev Number: 5 (DW_TAG_member)
    <63a>   DW_AT_name        : CR1
    <63e>   DW_AT_decl_file   : 5
    <63e>   DW_AT_decl_line   : 634
    <640>   DW_AT_decl_column : 17
    <640>   DW_AT_type        : <0x331>
    <644>   DW_AT_data_member_location: 0
 <2><645>: Abbrev Number: 5 (DW_TAG_member)
    <646>   DW_AT_name        : CR2
    <64a>   DW_AT_decl_file   : 5
    <64a>   DW_AT_decl_line   : 635
    <64c>   DW_AT_decl_column : 17
    <64c>   DW_AT_type        : <0x331>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x36ffd): SMCR
    <656>   DW_AT_decl_file   : 5
    <657>   DW_AT_decl_line   : 636
    <659>   DW_AT_decl_column : 17
    <65a>   DW_AT_type        : <0x331>
    <65e>   DW_AT_data_member_location: 8
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x3c923): DIER
    <664>   DW_AT_decl_file   : 5
    <665>   DW_AT_decl_line   : 637
    <667>   DW_AT_decl_column : 17
    <668>   DW_AT_type        : <0x331>
    <66c>   DW_AT_data_member_location: 12
 <2><66d>: Abbrev Number: 5 (DW_TAG_member)
    <66e>   DW_AT_name        : SR
    <671>   DW_AT_decl_file   : 5
    <671>   DW_AT_decl_line   : 638
    <673>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x331>
    <677>   DW_AT_data_member_location: 16
 <2><678>: Abbrev Number: 5 (DW_TAG_member)
    <679>   DW_AT_name        : EGR
    <67d>   DW_AT_decl_file   : 5
    <67d>   DW_AT_decl_line   : 639
    <67f>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x331>
    <683>   DW_AT_data_member_location: 20
 <2><684>: Abbrev Number: 1 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0xa95c7): CCMR1
    <689>   DW_AT_decl_file   : 5
    <68a>   DW_AT_decl_line   : 640
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x331>
    <691>   DW_AT_data_member_location: 24
 <2><692>: Abbrev Number: 1 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x4abc0): CCMR2
    <697>   DW_AT_decl_file   : 5
    <698>   DW_AT_decl_line   : 641
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x331>
    <69f>   DW_AT_data_member_location: 28
 <2><6a0>: Abbrev Number: 1 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x2de8b): CCER
    <6a5>   DW_AT_decl_file   : 5
    <6a6>   DW_AT_decl_line   : 642
    <6a8>   DW_AT_decl_column : 17
    <6a9>   DW_AT_type        : <0x331>
    <6ad>   DW_AT_data_member_location: 32
 <2><6ae>: Abbrev Number: 5 (DW_TAG_member)
    <6af>   DW_AT_name        : CNT
    <6b3>   DW_AT_decl_file   : 5
    <6b3>   DW_AT_decl_line   : 643
    <6b5>   DW_AT_decl_column : 17
    <6b5>   DW_AT_type        : <0x331>
    <6b9>   DW_AT_data_member_location: 36
 <2><6ba>: Abbrev Number: 5 (DW_TAG_member)
    <6bb>   DW_AT_name        : PSC
    <6bf>   DW_AT_decl_file   : 5
    <6bf>   DW_AT_decl_line   : 644
    <6c1>   DW_AT_decl_column : 17
    <6c1>   DW_AT_type        : <0x331>
    <6c5>   DW_AT_data_member_location: 40
 <2><6c6>: Abbrev Number: 5 (DW_TAG_member)
    <6c7>   DW_AT_name        : ARR
    <6cb>   DW_AT_decl_file   : 5
    <6cb>   DW_AT_decl_line   : 645
    <6cd>   DW_AT_decl_column : 17
    <6cd>   DW_AT_type        : <0x331>
    <6d1>   DW_AT_data_member_location: 44
 <2><6d2>: Abbrev Number: 5 (DW_TAG_member)
    <6d3>   DW_AT_name        : RCR
    <6d7>   DW_AT_decl_file   : 5
    <6d7>   DW_AT_decl_line   : 646
    <6d9>   DW_AT_decl_column : 17
    <6d9>   DW_AT_type        : <0x331>
    <6dd>   DW_AT_data_member_location: 48
 <2><6de>: Abbrev Number: 1 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0x169e2): CCR1
    <6e3>   DW_AT_decl_file   : 5
    <6e4>   DW_AT_decl_line   : 647
    <6e6>   DW_AT_decl_column : 17
    <6e7>   DW_AT_type        : <0x331>
    <6eb>   DW_AT_data_member_location: 52
 <2><6ec>: Abbrev Number: 1 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x4e789): CCR2
    <6f1>   DW_AT_decl_file   : 5
    <6f2>   DW_AT_decl_line   : 648
    <6f4>   DW_AT_decl_column : 17
    <6f5>   DW_AT_type        : <0x331>
    <6f9>   DW_AT_data_member_location: 56
 <2><6fa>: Abbrev Number: 1 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x8dd28): CCR3
    <6ff>   DW_AT_decl_file   : 5
    <700>   DW_AT_decl_line   : 649
    <702>   DW_AT_decl_column : 17
    <703>   DW_AT_type        : <0x331>
    <707>   DW_AT_data_member_location: 60
 <2><708>: Abbrev Number: 1 (DW_TAG_member)
    <709>   DW_AT_name        : (indirect string, offset: 0xba6c): CCR4
    <70d>   DW_AT_decl_file   : 5
    <70e>   DW_AT_decl_line   : 650
    <710>   DW_AT_decl_column : 17
    <711>   DW_AT_type        : <0x331>
    <715>   DW_AT_data_member_location: 64
 <2><716>: Abbrev Number: 1 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0x4f23a): BDTR
    <71b>   DW_AT_decl_file   : 5
    <71c>   DW_AT_decl_line   : 651
    <71e>   DW_AT_decl_column : 17
    <71f>   DW_AT_type        : <0x331>
    <723>   DW_AT_data_member_location: 68
 <2><724>: Abbrev Number: 5 (DW_TAG_member)
    <725>   DW_AT_name        : DCR
    <729>   DW_AT_decl_file   : 5
    <729>   DW_AT_decl_line   : 652
    <72b>   DW_AT_decl_column : 17
    <72b>   DW_AT_type        : <0x331>
    <72f>   DW_AT_data_member_location: 72
 <2><730>: Abbrev Number: 1 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x9f664): DMAR
    <735>   DW_AT_decl_file   : 5
    <736>   DW_AT_decl_line   : 653
    <738>   DW_AT_decl_column : 17
    <739>   DW_AT_type        : <0x331>
    <73d>   DW_AT_data_member_location: 76
 <2><73e>: Abbrev Number: 5 (DW_TAG_member)
    <73f>   DW_AT_name        : OR
    <742>   DW_AT_decl_file   : 5
    <742>   DW_AT_decl_line   : 654
    <744>   DW_AT_decl_column : 17
    <744>   DW_AT_type        : <0x331>
    <748>   DW_AT_data_member_location: 80
 <2><749>: Abbrev Number: 0
 <1><74a>: Abbrev Number: 8 (DW_TAG_typedef)
    <74b>   DW_AT_name        : (indirect string, offset: 0xbd385): TIM_TypeDef
    <74f>   DW_AT_decl_file   : 5
    <750>   DW_AT_decl_line   : 655
    <752>   DW_AT_decl_column : 3
    <753>   DW_AT_type        : <0x630>
 <1><757>: Abbrev Number: 10 (DW_TAG_base_type)
    <758>   DW_AT_byte_size   : 8
    <759>   DW_AT_encoding    : 4	(float)
    <75a>   DW_AT_name        : (indirect string, offset: 0xc3357): long double
 <1><75e>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <75f>   DW_AT_encoding    : 7	(unsigned)
    <760>   DW_AT_byte_size   : 1
    <761>   DW_AT_type        : <0x2b6>
    <765>   DW_AT_decl_file   : 6
    <766>   DW_AT_decl_line   : 39
    <767>   DW_AT_decl_column : 1
    <768>   DW_AT_sibling     : <0x785>
 <2><76c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <76d>   DW_AT_name        : (indirect string, offset: 0xbb4a1): HAL_OK
    <771>   DW_AT_const_value : 0
 <2><772>: Abbrev Number: 3 (DW_TAG_enumerator)
    <773>   DW_AT_name        : (indirect string, offset: 0xbc456): HAL_ERROR
    <777>   DW_AT_const_value : 1
 <2><778>: Abbrev Number: 3 (DW_TAG_enumerator)
    <779>   DW_AT_name        : (indirect string, offset: 0xbae89): HAL_BUSY
    <77d>   DW_AT_const_value : 2
 <2><77e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <77f>   DW_AT_name        : (indirect string, offset: 0xbb300): HAL_TIMEOUT
    <783>   DW_AT_const_value : 3
 <2><784>: Abbrev Number: 0
 <1><785>: Abbrev Number: 4 (DW_TAG_typedef)
    <786>   DW_AT_name        : (indirect string, offset: 0xba94e): HAL_StatusTypeDef
    <78a>   DW_AT_decl_file   : 6
    <78b>   DW_AT_decl_line   : 44
    <78c>   DW_AT_decl_column : 3
    <78d>   DW_AT_type        : <0x75e>
 <1><791>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <792>   DW_AT_encoding    : 7	(unsigned)
    <793>   DW_AT_byte_size   : 1
    <794>   DW_AT_type        : <0x2b6>
    <798>   DW_AT_decl_file   : 6
    <799>   DW_AT_decl_line   : 50
    <79a>   DW_AT_decl_column : 1
    <79b>   DW_AT_sibling     : <0x7ac>
 <2><79f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a0>   DW_AT_name        : (indirect string, offset: 0xbc92d): HAL_UNLOCKED
    <7a4>   DW_AT_const_value : 0
 <2><7a5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a6>   DW_AT_name        : (indirect string, offset: 0xbd60b): HAL_LOCKED
    <7aa>   DW_AT_const_value : 1
 <2><7ab>: Abbrev Number: 0
 <1><7ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <7ad>   DW_AT_name        : (indirect string, offset: 0xbc1a0): HAL_LockTypeDef
    <7b1>   DW_AT_decl_file   : 6
    <7b2>   DW_AT_decl_line   : 53
    <7b3>   DW_AT_decl_column : 3
    <7b4>   DW_AT_type        : <0x791>
 <1><7b8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7b9>   DW_AT_byte_size   : 24
    <7ba>   DW_AT_decl_file   : 7
    <7bb>   DW_AT_decl_line   : 45
    <7bc>   DW_AT_decl_column : 9
    <7bc>   DW_AT_sibling     : <0x80f>
 <2><7c0>: Abbrev Number: 2 (DW_TAG_member)
    <7c1>   DW_AT_name        : (indirect string, offset: 0xbc641): PLLState
    <7c5>   DW_AT_decl_file   : 7
    <7c6>   DW_AT_decl_line   : 47
    <7c7>   DW_AT_decl_column : 12
    <7c8>   DW_AT_type        : <0x325>
    <7cc>   DW_AT_data_member_location: 0
 <2><7cd>: Abbrev Number: 2 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xbc7f2): PLLSource
    <7d2>   DW_AT_decl_file   : 7
    <7d3>   DW_AT_decl_line   : 50
    <7d4>   DW_AT_decl_column : 12
    <7d5>   DW_AT_type        : <0x325>
    <7d9>   DW_AT_data_member_location: 4
 <2><7da>: Abbrev Number: 2 (DW_TAG_member)
    <7db>   DW_AT_name        : (indirect string, offset: 0xbcd66): PLLM
    <7df>   DW_AT_decl_file   : 7
    <7e0>   DW_AT_decl_line   : 53
    <7e1>   DW_AT_decl_column : 12
    <7e2>   DW_AT_type        : <0x325>
    <7e6>   DW_AT_data_member_location: 8
 <2><7e7>: Abbrev Number: 2 (DW_TAG_member)
    <7e8>   DW_AT_name        : (indirect string, offset: 0xbcd6b): PLLN
    <7ec>   DW_AT_decl_file   : 7
    <7ed>   DW_AT_decl_line   : 56
    <7ee>   DW_AT_decl_column : 12
    <7ef>   DW_AT_type        : <0x325>
    <7f3>   DW_AT_data_member_location: 12
 <2><7f4>: Abbrev Number: 2 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xbcd70): PLLP
    <7f9>   DW_AT_decl_file   : 7
    <7fa>   DW_AT_decl_line   : 60
    <7fb>   DW_AT_decl_column : 12
    <7fc>   DW_AT_type        : <0x325>
    <800>   DW_AT_data_member_location: 16
 <2><801>: Abbrev Number: 2 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0x45b80): PLLQ
    <806>   DW_AT_decl_file   : 7
    <807>   DW_AT_decl_line   : 63
    <808>   DW_AT_decl_column : 12
    <809>   DW_AT_type        : <0x325>
    <80d>   DW_AT_data_member_location: 20
 <2><80e>: Abbrev Number: 0
 <1><80f>: Abbrev Number: 4 (DW_TAG_typedef)
    <810>   DW_AT_name        : (indirect string, offset: 0xbc225): RCC_PLLInitTypeDef
    <814>   DW_AT_decl_file   : 7
    <815>   DW_AT_decl_line   : 73
    <816>   DW_AT_decl_column : 2
    <817>   DW_AT_type        : <0x7b8>
 <1><81b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <81c>   DW_AT_byte_size   : 48
    <81d>   DW_AT_decl_file   : 8
    <81e>   DW_AT_decl_line   : 49
    <81f>   DW_AT_decl_column : 9
    <81f>   DW_AT_sibling     : <0x87f>
 <2><823>: Abbrev Number: 2 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0xbcc81): OscillatorType
    <828>   DW_AT_decl_file   : 8
    <829>   DW_AT_decl_line   : 51
    <82a>   DW_AT_decl_column : 12
    <82b>   DW_AT_type        : <0x325>
    <82f>   DW_AT_data_member_location: 0
 <2><830>: Abbrev Number: 2 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0xbc654): HSEState
    <835>   DW_AT_decl_file   : 8
    <836>   DW_AT_decl_line   : 54
    <837>   DW_AT_decl_column : 12
    <838>   DW_AT_type        : <0x325>
    <83c>   DW_AT_data_member_location: 4
 <2><83d>: Abbrev Number: 2 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0xbc521): LSEState
    <842>   DW_AT_decl_file   : 8
    <843>   DW_AT_decl_line   : 57
    <844>   DW_AT_decl_column : 12
    <845>   DW_AT_type        : <0x325>
    <849>   DW_AT_data_member_location: 8
 <2><84a>: Abbrev Number: 2 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0xbb917): HSIState
    <84f>   DW_AT_decl_file   : 8
    <850>   DW_AT_decl_line   : 60
    <851>   DW_AT_decl_column : 12
    <852>   DW_AT_type        : <0x325>
    <856>   DW_AT_data_member_location: 12
 <2><857>: Abbrev Number: 2 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0xbced6): HSICalibrationValue
    <85c>   DW_AT_decl_file   : 8
    <85d>   DW_AT_decl_line   : 63
    <85e>   DW_AT_decl_column : 12
    <85f>   DW_AT_type        : <0x325>
    <863>   DW_AT_data_member_location: 16
 <2><864>: Abbrev Number: 2 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0xbb5bf): LSIState
    <869>   DW_AT_decl_file   : 8
    <86a>   DW_AT_decl_line   : 66
    <86b>   DW_AT_decl_column : 12
    <86c>   DW_AT_type        : <0x325>
    <870>   DW_AT_data_member_location: 20
 <2><871>: Abbrev Number: 26 (DW_TAG_member)
    <872>   DW_AT_name        : PLL
    <876>   DW_AT_decl_file   : 8
    <877>   DW_AT_decl_line   : 69
    <878>   DW_AT_decl_column : 22
    <879>   DW_AT_type        : <0x80f>
    <87d>   DW_AT_data_member_location: 24
 <2><87e>: Abbrev Number: 0
 <1><87f>: Abbrev Number: 4 (DW_TAG_typedef)
    <880>   DW_AT_name        : (indirect string, offset: 0xbbd12): RCC_OscInitTypeDef
    <884>   DW_AT_decl_file   : 8
    <885>   DW_AT_decl_line   : 70
    <886>   DW_AT_decl_column : 2
    <887>   DW_AT_type        : <0x81b>
 <1><88b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <88c>   DW_AT_byte_size   : 20
    <88d>   DW_AT_decl_file   : 8
    <88e>   DW_AT_decl_line   : 75
    <88f>   DW_AT_decl_column : 9
    <88f>   DW_AT_sibling     : <0x8d5>
 <2><893>: Abbrev Number: 2 (DW_TAG_member)
    <894>   DW_AT_name        : (indirect string, offset: 0xbb31f): ClockType
    <898>   DW_AT_decl_file   : 8
    <899>   DW_AT_decl_line   : 77
    <89a>   DW_AT_decl_column : 12
    <89b>   DW_AT_type        : <0x325>
    <89f>   DW_AT_data_member_location: 0
 <2><8a0>: Abbrev Number: 2 (DW_TAG_member)
    <8a1>   DW_AT_name        : (indirect string, offset: 0xbc218): SYSCLKSource
    <8a5>   DW_AT_decl_file   : 8
    <8a6>   DW_AT_decl_line   : 80
    <8a7>   DW_AT_decl_column : 12
    <8a8>   DW_AT_type        : <0x325>
    <8ac>   DW_AT_data_member_location: 4
 <2><8ad>: Abbrev Number: 2 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xbccd4): AHBCLKDivider
    <8b2>   DW_AT_decl_file   : 8
    <8b3>   DW_AT_decl_line   : 83
    <8b4>   DW_AT_decl_column : 12
    <8b5>   DW_AT_type        : <0x325>
    <8b9>   DW_AT_data_member_location: 8
 <2><8ba>: Abbrev Number: 2 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0xbaa4e): APB1CLKDivider
    <8bf>   DW_AT_decl_file   : 8
    <8c0>   DW_AT_decl_line   : 86
    <8c1>   DW_AT_decl_column : 12
    <8c2>   DW_AT_type        : <0x325>
    <8c6>   DW_AT_data_member_location: 12
 <2><8c7>: Abbrev Number: 2 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0xbb951): APB2CLKDivider
    <8cc>   DW_AT_decl_file   : 8
    <8cd>   DW_AT_decl_line   : 89
    <8ce>   DW_AT_decl_column : 12
    <8cf>   DW_AT_type        : <0x325>
    <8d3>   DW_AT_data_member_location: 16
 <2><8d4>: Abbrev Number: 0
 <1><8d5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d6>   DW_AT_name        : (indirect string, offset: 0xbc868): RCC_ClkInitTypeDef
    <8da>   DW_AT_decl_file   : 8
    <8db>   DW_AT_decl_line   : 92
    <8dc>   DW_AT_decl_column : 2
    <8dd>   DW_AT_type        : <0x88b>
 <1><8e1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <8e2>   DW_AT_byte_size   : 20
    <8e3>   DW_AT_decl_file   : 9
    <8e4>   DW_AT_decl_line   : 46
    <8e5>   DW_AT_decl_column : 9
    <8e5>   DW_AT_sibling     : <0x92b>
 <2><8e9>: Abbrev Number: 26 (DW_TAG_member)
    <8ea>   DW_AT_name        : Pin
    <8ee>   DW_AT_decl_file   : 9
    <8ef>   DW_AT_decl_line   : 48
    <8f0>   DW_AT_decl_column : 12
    <8f1>   DW_AT_type        : <0x325>
    <8f5>   DW_AT_data_member_location: 0
 <2><8f6>: Abbrev Number: 2 (DW_TAG_member)
    <8f7>   DW_AT_name        : (indirect string, offset: 0xbf005): Mode
    <8fb>   DW_AT_decl_file   : 9
    <8fc>   DW_AT_decl_line   : 51
    <8fd>   DW_AT_decl_column : 12
    <8fe>   DW_AT_type        : <0x325>
    <902>   DW_AT_data_member_location: 4
 <2><903>: Abbrev Number: 2 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0xbbbfa): Pull
    <908>   DW_AT_decl_file   : 9
    <909>   DW_AT_decl_line   : 54
    <90a>   DW_AT_decl_column : 12
    <90b>   DW_AT_type        : <0x325>
    <90f>   DW_AT_data_member_location: 8
 <2><910>: Abbrev Number: 2 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0xbc15e): Speed
    <915>   DW_AT_decl_file   : 9
    <916>   DW_AT_decl_line   : 57
    <917>   DW_AT_decl_column : 12
    <918>   DW_AT_type        : <0x325>
    <91c>   DW_AT_data_member_location: 12
 <2><91d>: Abbrev Number: 2 (DW_TAG_member)
    <91e>   DW_AT_name        : (indirect string, offset: 0xbb947): Alternate
    <922>   DW_AT_decl_file   : 9
    <923>   DW_AT_decl_line   : 60
    <924>   DW_AT_decl_column : 12
    <925>   DW_AT_type        : <0x325>
    <929>   DW_AT_data_member_location: 16
 <2><92a>: Abbrev Number: 0
 <1><92b>: Abbrev Number: 4 (DW_TAG_typedef)
    <92c>   DW_AT_name        : (indirect string, offset: 0xbcad9): GPIO_InitTypeDef
    <930>   DW_AT_decl_file   : 9
    <931>   DW_AT_decl_line   : 62
    <932>   DW_AT_decl_column : 2
    <933>   DW_AT_type        : <0x8e1>
 <1><937>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <938>   DW_AT_encoding    : 7	(unsigned)
    <939>   DW_AT_byte_size   : 1
    <93a>   DW_AT_type        : <0x2b6>
    <93e>   DW_AT_decl_file   : 9
    <93f>   DW_AT_decl_line   : 68
    <940>   DW_AT_decl_column : 1
    <941>   DW_AT_sibling     : <0x952>
 <2><945>: Abbrev Number: 3 (DW_TAG_enumerator)
    <946>   DW_AT_name        : (indirect string, offset: 0xbb010): GPIO_PIN_RESET
    <94a>   DW_AT_const_value : 0
 <2><94b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <94c>   DW_AT_name        : (indirect string, offset: 0xbaf20): GPIO_PIN_SET
    <950>   DW_AT_const_value : 1
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 4 (DW_TAG_typedef)
    <953>   DW_AT_name        : (indirect string, offset: 0xbd464): GPIO_PinState
    <957>   DW_AT_decl_file   : 9
    <958>   DW_AT_decl_line   : 71
    <959>   DW_AT_decl_column : 2
    <95a>   DW_AT_type        : <0x937>
 <1><95e>: Abbrev Number: 16 (DW_TAG_structure_type)
    <95f>   DW_AT_byte_size   : 48
    <960>   DW_AT_decl_file   : 10
    <961>   DW_AT_decl_line   : 48
    <962>   DW_AT_decl_column : 9
    <962>   DW_AT_sibling     : <0xa03>
 <2><966>: Abbrev Number: 2 (DW_TAG_member)
    <967>   DW_AT_name        : (indirect string, offset: 0xbbc6d): Channel
    <96b>   DW_AT_decl_file   : 10
    <96c>   DW_AT_decl_line   : 50
    <96d>   DW_AT_decl_column : 12
    <96e>   DW_AT_type        : <0x325>
    <972>   DW_AT_data_member_location: 0
 <2><973>: Abbrev Number: 2 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0xbb69e): Direction
    <978>   DW_AT_decl_file   : 10
    <979>   DW_AT_decl_line   : 53
    <97a>   DW_AT_decl_column : 12
    <97b>   DW_AT_type        : <0x325>
    <97f>   DW_AT_data_member_location: 4
 <2><980>: Abbrev Number: 2 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0xbac3d): PeriphInc
    <985>   DW_AT_decl_file   : 10
    <986>   DW_AT_decl_line   : 57
    <987>   DW_AT_decl_column : 12
    <988>   DW_AT_type        : <0x325>
    <98c>   DW_AT_data_member_location: 8
 <2><98d>: Abbrev Number: 2 (DW_TAG_member)
    <98e>   DW_AT_name        : (indirect string, offset: 0xbae5a): MemInc
    <992>   DW_AT_decl_file   : 10
    <993>   DW_AT_decl_line   : 60
    <994>   DW_AT_decl_column : 12
    <995>   DW_AT_type        : <0x325>
    <999>   DW_AT_data_member_location: 12
 <2><99a>: Abbrev Number: 2 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0xbbbd6): PeriphDataAlignment
    <99f>   DW_AT_decl_file   : 10
    <9a0>   DW_AT_decl_line   : 63
    <9a1>   DW_AT_decl_column : 12
    <9a2>   DW_AT_type        : <0x325>
    <9a6>   DW_AT_data_member_location: 16
 <2><9a7>: Abbrev Number: 2 (DW_TAG_member)
    <9a8>   DW_AT_name        : (indirect string, offset: 0xbd0ad): MemDataAlignment
    <9ac>   DW_AT_decl_file   : 10
    <9ad>   DW_AT_decl_line   : 66
    <9ae>   DW_AT_decl_column : 12
    <9af>   DW_AT_type        : <0x325>
    <9b3>   DW_AT_data_member_location: 20
 <2><9b4>: Abbrev Number: 2 (DW_TAG_member)
    <9b5>   DW_AT_name        : (indirect string, offset: 0xbf005): Mode
    <9b9>   DW_AT_decl_file   : 10
    <9ba>   DW_AT_decl_line   : 69
    <9bb>   DW_AT_decl_column : 12
    <9bc>   DW_AT_type        : <0x325>
    <9c0>   DW_AT_data_member_location: 24
 <2><9c1>: Abbrev Number: 2 (DW_TAG_member)
    <9c2>   DW_AT_name        : (indirect string, offset: 0xbe540): Priority
    <9c6>   DW_AT_decl_file   : 10
    <9c7>   DW_AT_decl_line   : 74
    <9c8>   DW_AT_decl_column : 12
    <9c9>   DW_AT_type        : <0x325>
    <9cd>   DW_AT_data_member_location: 28
 <2><9ce>: Abbrev Number: 2 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0xbb8f7): FIFOMode
    <9d3>   DW_AT_decl_file   : 10
    <9d4>   DW_AT_decl_line   : 77
    <9d5>   DW_AT_decl_column : 12
    <9d6>   DW_AT_type        : <0x325>
    <9da>   DW_AT_data_member_location: 32
 <2><9db>: Abbrev Number: 2 (DW_TAG_member)
    <9dc>   DW_AT_name        : (indirect string, offset: 0xbc991): FIFOThreshold
    <9e0>   DW_AT_decl_file   : 10
    <9e1>   DW_AT_decl_line   : 82
    <9e2>   DW_AT_decl_column : 12
    <9e3>   DW_AT_type        : <0x325>
    <9e7>   DW_AT_data_member_location: 36
 <2><9e8>: Abbrev Number: 2 (DW_TAG_member)
    <9e9>   DW_AT_name        : (indirect string, offset: 0xbc93a): MemBurst
    <9ed>   DW_AT_decl_file   : 10
    <9ee>   DW_AT_decl_line   : 85
    <9ef>   DW_AT_decl_column : 12
    <9f0>   DW_AT_type        : <0x325>
    <9f4>   DW_AT_data_member_location: 40
 <2><9f5>: Abbrev Number: 2 (DW_TAG_member)
    <9f6>   DW_AT_name        : (indirect string, offset: 0xbb58c): PeriphBurst
    <9fa>   DW_AT_decl_file   : 10
    <9fb>   DW_AT_decl_line   : 91
    <9fc>   DW_AT_decl_column : 12
    <9fd>   DW_AT_type        : <0x325>
    <a01>   DW_AT_data_member_location: 44
 <2><a02>: Abbrev Number: 0
 <1><a03>: Abbrev Number: 4 (DW_TAG_typedef)
    <a04>   DW_AT_name        : (indirect string, offset: 0xbb1ac): DMA_InitTypeDef
    <a08>   DW_AT_decl_file   : 10
    <a09>   DW_AT_decl_line   : 96
    <a0a>   DW_AT_decl_column : 2
    <a0b>   DW_AT_type        : <0x95e>
 <1><a0f>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <a10>   DW_AT_encoding    : 7	(unsigned)
    <a11>   DW_AT_byte_size   : 1
    <a12>   DW_AT_type        : <0x2b6>
    <a16>   DW_AT_decl_file   : 10
    <a17>   DW_AT_decl_line   : 103
    <a18>   DW_AT_decl_column : 1
    <a19>   DW_AT_sibling     : <0xa42>
 <2><a1d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a1e>   DW_AT_name        : (indirect string, offset: 0xbab73): HAL_DMA_STATE_RESET
    <a22>   DW_AT_const_value : 0
 <2><a23>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a24>   DW_AT_name        : (indirect string, offset: 0xbb1c7): HAL_DMA_STATE_READY
    <a28>   DW_AT_const_value : 1
 <2><a29>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a2a>   DW_AT_name        : (indirect string, offset: 0xbc6fc): HAL_DMA_STATE_BUSY
    <a2e>   DW_AT_const_value : 2
 <2><a2f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0xbd496): HAL_DMA_STATE_TIMEOUT
    <a34>   DW_AT_const_value : 3
 <2><a35>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xbc97d): HAL_DMA_STATE_ERROR
    <a3a>   DW_AT_const_value : 4
 <2><a3b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xbb6c9): HAL_DMA_STATE_ABORT
    <a40>   DW_AT_const_value : 5
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 4 (DW_TAG_typedef)
    <a43>   DW_AT_name        : (indirect string, offset: 0xbd098): HAL_DMA_StateTypeDef
    <a47>   DW_AT_decl_file   : 10
    <a48>   DW_AT_decl_line   : 110
    <a49>   DW_AT_decl_column : 2
    <a4a>   DW_AT_type        : <0xa0f>
 <1><a4e>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <a4f>   DW_AT_type        : <0xa42>
 <1><a53>: Abbrev Number: 32 (DW_TAG_structure_type)
    <a54>   DW_AT_name        : (indirect string, offset: 0xbce7d): __DMA_HandleTypeDef
    <a58>   DW_AT_byte_size   : 96
    <a59>   DW_AT_decl_file   : 10
    <a5a>   DW_AT_decl_line   : 138
    <a5b>   DW_AT_decl_column : 16
    <a5c>   DW_AT_sibling     : <0xb17>
 <2><a60>: Abbrev Number: 2 (DW_TAG_member)
    <a61>   DW_AT_name        : (indirect string, offset: 0xbd444): Instance
    <a65>   DW_AT_decl_file   : 10
    <a66>   DW_AT_decl_line   : 140
    <a67>   DW_AT_decl_column : 31
    <a68>   DW_AT_type        : <0xb17>
    <a6c>   DW_AT_data_member_location: 0
 <2><a6d>: Abbrev Number: 2 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0xbec44): Init
    <a72>   DW_AT_decl_file   : 10
    <a73>   DW_AT_decl_line   : 142
    <a74>   DW_AT_decl_column : 30
    <a75>   DW_AT_type        : <0xa03>
    <a79>   DW_AT_data_member_location: 4
 <2><a7a>: Abbrev Number: 2 (DW_TAG_member)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x843a2): Lock
    <a7f>   DW_AT_decl_file   : 10
    <a80>   DW_AT_decl_line   : 144
    <a81>   DW_AT_decl_column : 30
    <a82>   DW_AT_type        : <0x7ac>
    <a86>   DW_AT_data_member_location: 52
 <2><a87>: Abbrev Number: 2 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0xbc657): State
    <a8c>   DW_AT_decl_file   : 10
    <a8d>   DW_AT_decl_line   : 146
    <a8e>   DW_AT_decl_column : 30
    <a8f>   DW_AT_type        : <0xa4e>
    <a93>   DW_AT_data_member_location: 53
 <2><a94>: Abbrev Number: 2 (DW_TAG_member)
    <a95>   DW_AT_name        : (indirect string, offset: 0xbd417): Parent
    <a99>   DW_AT_decl_file   : 10
    <a9a>   DW_AT_decl_line   : 148
    <a9b>   DW_AT_decl_column : 31
    <a9c>   DW_AT_type        : <0xb1c>
    <aa0>   DW_AT_data_member_location: 56
 <2><aa1>: Abbrev Number: 2 (DW_TAG_member)
    <aa2>   DW_AT_name        : (indirect string, offset: 0xbd5fa): XferCpltCallback
    <aa6>   DW_AT_decl_file   : 10
    <aa7>   DW_AT_decl_line   : 150
    <aa8>   DW_AT_decl_column : 33
    <aa9>   DW_AT_type        : <0xb2e>
    <aad>   DW_AT_data_member_location: 60
 <2><aae>: Abbrev Number: 2 (DW_TAG_member)
    <aaf>   DW_AT_name        : (indirect string, offset: 0xbc9fe): XferHalfCpltCallback
    <ab3>   DW_AT_decl_file   : 10
    <ab4>   DW_AT_decl_line   : 152
    <ab5>   DW_AT_decl_column : 33
    <ab6>   DW_AT_type        : <0xb2e>
    <aba>   DW_AT_data_member_location: 64
 <2><abb>: Abbrev Number: 2 (DW_TAG_member)
    <abc>   DW_AT_name        : (indirect string, offset: 0xbc164): XferM1CpltCallback
    <ac0>   DW_AT_decl_file   : 10
    <ac1>   DW_AT_decl_line   : 154
    <ac2>   DW_AT_decl_column : 33
    <ac3>   DW_AT_type        : <0xb2e>
    <ac7>   DW_AT_data_member_location: 68
 <2><ac8>: Abbrev Number: 2 (DW_TAG_member)
    <ac9>   DW_AT_name        : (indirect string, offset: 0xbbb7a): XferM1HalfCpltCallback
    <acd>   DW_AT_decl_file   : 10
    <ace>   DW_AT_decl_line   : 156
    <acf>   DW_AT_decl_column : 33
    <ad0>   DW_AT_type        : <0xb2e>
    <ad4>   DW_AT_data_member_location: 72
 <2><ad5>: Abbrev Number: 2 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0xbae13): XferErrorCallback
    <ada>   DW_AT_decl_file   : 10
    <adb>   DW_AT_decl_line   : 158
    <adc>   DW_AT_decl_column : 33
    <add>   DW_AT_type        : <0xb2e>
    <ae1>   DW_AT_data_member_location: 76
 <2><ae2>: Abbrev Number: 2 (DW_TAG_member)
    <ae3>   DW_AT_name        : (indirect string, offset: 0xbd204): XferAbortCallback
    <ae7>   DW_AT_decl_file   : 10
    <ae8>   DW_AT_decl_line   : 160
    <ae9>   DW_AT_decl_column : 33
    <aea>   DW_AT_type        : <0xb2e>
    <aee>   DW_AT_data_member_location: 80
 <2><aef>: Abbrev Number: 2 (DW_TAG_member)
    <af0>   DW_AT_name        : (indirect string, offset: 0xbd45a): ErrorCode
    <af4>   DW_AT_decl_file   : 10
    <af5>   DW_AT_decl_line   : 162
    <af6>   DW_AT_decl_column : 30
    <af7>   DW_AT_type        : <0x331>
    <afb>   DW_AT_data_member_location: 84
 <2><afc>: Abbrev Number: 2 (DW_TAG_member)
    <afd>   DW_AT_name        : (indirect string, offset: 0xbb920): StreamBaseAddress
    <b01>   DW_AT_decl_file   : 10
    <b02>   DW_AT_decl_line   : 164
    <b03>   DW_AT_decl_column : 30
    <b04>   DW_AT_type        : <0x325>
    <b08>   DW_AT_data_member_location: 88
 <2><b09>: Abbrev Number: 2 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0xbcdee): StreamIndex
    <b0e>   DW_AT_decl_file   : 10
    <b0f>   DW_AT_decl_line   : 166
    <b10>   DW_AT_decl_column : 30
    <b11>   DW_AT_type        : <0x325>
    <b15>   DW_AT_data_member_location: 92
 <2><b16>: Abbrev Number: 0
 <1><b17>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b18>   DW_AT_byte_size   : 4
    <b18>   DW_AT_type        : <0x39d>
 <1><b1c>: Abbrev Number: 33 (DW_TAG_pointer_type)
    <b1d>   DW_AT_byte_size   : 4
 <1><b1e>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <b1f>   DW_AT_prototyped  : 1
    <b1f>   DW_AT_sibling     : <0xb29>
 <2><b23>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <b24>   DW_AT_type        : <0xb29>
 <2><b28>: Abbrev Number: 0
 <1><b29>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b2a>   DW_AT_byte_size   : 4
    <b2a>   DW_AT_type        : <0xa53>
 <1><b2e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b2f>   DW_AT_byte_size   : 4
    <b2f>   DW_AT_type        : <0xb1e>
 <1><b33>: Abbrev Number: 4 (DW_TAG_typedef)
    <b34>   DW_AT_name        : (indirect string, offset: 0xbce7f): DMA_HandleTypeDef
    <b38>   DW_AT_decl_file   : 10
    <b39>   DW_AT_decl_line   : 168
    <b3a>   DW_AT_decl_column : 2
    <b3b>   DW_AT_type        : <0xa53>
 <1><b3f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <b40>   DW_AT_byte_size   : 24
    <b41>   DW_AT_decl_file   : 11
    <b42>   DW_AT_decl_line   : 46
    <b43>   DW_AT_decl_column : 9
    <b43>   DW_AT_sibling     : <0xb96>
 <2><b47>: Abbrev Number: 2 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0xbf142): Prescaler
    <b4c>   DW_AT_decl_file   : 11
    <b4d>   DW_AT_decl_line   : 48
    <b4e>   DW_AT_decl_column : 12
    <b4f>   DW_AT_type        : <0x325>
    <b53>   DW_AT_data_member_location: 0
 <2><b54>: Abbrev Number: 2 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0xbd0ec): CounterMode
    <b59>   DW_AT_decl_file   : 11
    <b5a>   DW_AT_decl_line   : 51
    <b5b>   DW_AT_decl_column : 12
    <b5c>   DW_AT_type        : <0x325>
    <b60>   DW_AT_data_member_location: 4
 <2><b61>: Abbrev Number: 2 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0xbcaaa): Period
    <b66>   DW_AT_decl_file   : 11
    <b67>   DW_AT_decl_line   : 54
    <b68>   DW_AT_decl_column : 12
    <b69>   DW_AT_type        : <0x325>
    <b6d>   DW_AT_data_member_location: 8
 <2><b6e>: Abbrev Number: 2 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0xbb78e): ClockDivision
    <b73>   DW_AT_decl_file   : 11
    <b74>   DW_AT_decl_line   : 58
    <b75>   DW_AT_decl_column : 12
    <b76>   DW_AT_type        : <0x325>
    <b7a>   DW_AT_data_member_location: 12
 <2><b7b>: Abbrev Number: 2 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xbc856): RepetitionCounter
    <b80>   DW_AT_decl_file   : 11
    <b81>   DW_AT_decl_line   : 61
    <b82>   DW_AT_decl_column : 12
    <b83>   DW_AT_type        : <0x325>
    <b87>   DW_AT_data_member_location: 16
 <2><b88>: Abbrev Number: 2 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0xbd198): AutoReloadPreload
    <b8d>   DW_AT_decl_file   : 11
    <b8e>   DW_AT_decl_line   : 72
    <b8f>   DW_AT_decl_column : 12
    <b90>   DW_AT_type        : <0x325>
    <b94>   DW_AT_data_member_location: 20
 <2><b95>: Abbrev Number: 0
 <1><b96>: Abbrev Number: 4 (DW_TAG_typedef)
    <b97>   DW_AT_name        : (indirect string, offset: 0xbb5aa): TIM_Base_InitTypeDef
    <b9b>   DW_AT_decl_file   : 11
    <b9c>   DW_AT_decl_line   : 74
    <b9d>   DW_AT_decl_column : 3
    <b9e>   DW_AT_type        : <0xb3f>
 <1><ba2>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <ba3>   DW_AT_encoding    : 7	(unsigned)
    <ba3>   DW_AT_byte_size   : 1
    <ba3>   DW_AT_type        : <0x2b6>
    <ba7>   DW_AT_decl_file   : 11
    <ba7>   DW_AT_decl_line   : 291
    <ba9>   DW_AT_decl_column : 1
    <ba9>   DW_AT_sibling     : <0xbcc>
 <2><bad>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0xbc460): HAL_TIM_STATE_RESET
    <bb2>   DW_AT_const_value : 0
 <2><bb3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xbaa3a): HAL_TIM_STATE_READY
    <bb8>   DW_AT_const_value : 1
 <2><bb9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0xbb164): HAL_TIM_STATE_BUSY
    <bbe>   DW_AT_const_value : 2
 <2><bbf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bc0>   DW_AT_name        : (indirect string, offset: 0xbcdb0): HAL_TIM_STATE_TIMEOUT
    <bc4>   DW_AT_const_value : 3
 <2><bc5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bc6>   DW_AT_name        : (indirect string, offset: 0xbc42e): HAL_TIM_STATE_ERROR
    <bca>   DW_AT_const_value : 4
 <2><bcb>: Abbrev Number: 0
 <1><bcc>: Abbrev Number: 8 (DW_TAG_typedef)
    <bcd>   DW_AT_name        : (indirect string, offset: 0xbc5e3): HAL_TIM_StateTypeDef
    <bd1>   DW_AT_decl_file   : 11
    <bd2>   DW_AT_decl_line   : 297
    <bd4>   DW_AT_decl_column : 3
    <bd5>   DW_AT_type        : <0xba2>
 <1><bd9>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <bda>   DW_AT_type        : <0xbcc>
 <1><bde>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <bdf>   DW_AT_encoding    : 7	(unsigned)
    <bdf>   DW_AT_byte_size   : 1
    <bdf>   DW_AT_type        : <0x2b6>
    <be3>   DW_AT_decl_file   : 11
    <be3>   DW_AT_decl_line   : 303
    <be5>   DW_AT_decl_column : 1
    <be5>   DW_AT_sibling     : <0xbfc>
 <2><be9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bea>   DW_AT_name        : (indirect string, offset: 0xbab09): HAL_TIM_CHANNEL_STATE_RESET
    <bee>   DW_AT_const_value : 0
 <2><bef>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bf0>   DW_AT_name        : (indirect string, offset: 0xbc177): HAL_TIM_CHANNEL_STATE_READY
    <bf4>   DW_AT_const_value : 1
 <2><bf5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bf6>   DW_AT_name        : (indirect string, offset: 0xbbb91): HAL_TIM_CHANNEL_STATE_BUSY
    <bfa>   DW_AT_const_value : 2
 <2><bfb>: Abbrev Number: 0
 <1><bfc>: Abbrev Number: 8 (DW_TAG_typedef)
    <bfd>   DW_AT_name        : (indirect string, offset: 0xbb0b7): HAL_TIM_ChannelStateTypeDef
    <c01>   DW_AT_decl_file   : 11
    <c02>   DW_AT_decl_line   : 307
    <c04>   DW_AT_decl_column : 3
    <c05>   DW_AT_type        : <0xbde>
 <1><c09>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c0a>   DW_AT_type        : <0xbfc>
 <1><c0e>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <c0f>   DW_AT_encoding    : 7	(unsigned)
    <c0f>   DW_AT_byte_size   : 1
    <c0f>   DW_AT_type        : <0x2b6>
    <c13>   DW_AT_decl_file   : 11
    <c13>   DW_AT_decl_line   : 313
    <c15>   DW_AT_decl_column : 1
    <c15>   DW_AT_sibling     : <0xc2c>
 <2><c19>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xbaa20): HAL_DMA_BURST_STATE_RESET
    <c1e>   DW_AT_const_value : 0
 <2><c1f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c20>   DW_AT_name        : (indirect string, offset: 0xbbed8): HAL_DMA_BURST_STATE_READY
    <c24>   DW_AT_const_value : 1
 <2><c25>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c26>   DW_AT_name        : (indirect string, offset: 0xbb488): HAL_DMA_BURST_STATE_BUSY
    <c2a>   DW_AT_const_value : 2
 <2><c2b>: Abbrev Number: 0
 <1><c2c>: Abbrev Number: 8 (DW_TAG_typedef)
    <c2d>   DW_AT_name        : (indirect string, offset: 0xbadf1): HAL_TIM_DMABurstStateTypeDef
    <c31>   DW_AT_decl_file   : 11
    <c32>   DW_AT_decl_line   : 317
    <c34>   DW_AT_decl_column : 3
    <c35>   DW_AT_type        : <0xc0e>
 <1><c39>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c3a>   DW_AT_type        : <0xc2c>
 <1><c3e>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <c3f>   DW_AT_encoding    : 7	(unsigned)
    <c3f>   DW_AT_byte_size   : 1
    <c3f>   DW_AT_type        : <0x2b6>
    <c43>   DW_AT_decl_file   : 11
    <c43>   DW_AT_decl_line   : 323
    <c45>   DW_AT_decl_column : 1
    <c45>   DW_AT_sibling     : <0xc68>
 <2><c49>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xbbf05): HAL_TIM_ACTIVE_CHANNEL_1
    <c4e>   DW_AT_const_value : 1
 <2><c4f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c50>   DW_AT_name        : (indirect string, offset: 0xbbf1e): HAL_TIM_ACTIVE_CHANNEL_2
    <c54>   DW_AT_const_value : 2
 <2><c55>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c56>   DW_AT_name        : (indirect string, offset: 0xbbf37): HAL_TIM_ACTIVE_CHANNEL_3
    <c5a>   DW_AT_const_value : 4
 <2><c5b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c5c>   DW_AT_name        : (indirect string, offset: 0xbbf50): HAL_TIM_ACTIVE_CHANNEL_4
    <c60>   DW_AT_const_value : 8
 <2><c61>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c62>   DW_AT_name        : (indirect string, offset: 0xbb7a9): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <c66>   DW_AT_const_value : 0
 <2><c67>: Abbrev Number: 0
 <1><c68>: Abbrev Number: 8 (DW_TAG_typedef)
    <c69>   DW_AT_name        : (indirect string, offset: 0xbbc5f): HAL_TIM_ActiveChannel
    <c6d>   DW_AT_decl_file   : 11
    <c6e>   DW_AT_decl_line   : 329
    <c70>   DW_AT_decl_column : 3
    <c71>   DW_AT_type        : <0xc3e>
 <1><c75>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c76>   DW_AT_byte_size   : 72
    <c77>   DW_AT_decl_file   : 11
    <c78>   DW_AT_decl_line   : 337
    <c7a>   DW_AT_decl_column : 9
    <c7a>   DW_AT_sibling     : <0xcfd>
 <2><c7e>: Abbrev Number: 1 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xbd444): Instance
    <c83>   DW_AT_decl_file   : 11
    <c84>   DW_AT_decl_line   : 340
    <c86>   DW_AT_decl_column : 39
    <c87>   DW_AT_type        : <0xcfd>
    <c8b>   DW_AT_data_member_location: 0
 <2><c8c>: Abbrev Number: 1 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xbec44): Init
    <c91>   DW_AT_decl_file   : 11
    <c92>   DW_AT_decl_line   : 341
    <c94>   DW_AT_decl_column : 38
    <c95>   DW_AT_type        : <0xb96>
    <c99>   DW_AT_data_member_location: 4
 <2><c9a>: Abbrev Number: 1 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0xbbc6d): Channel
    <c9f>   DW_AT_decl_file   : 11
    <ca0>   DW_AT_decl_line   : 342
    <ca2>   DW_AT_decl_column : 38
    <ca3>   DW_AT_type        : <0xc68>
    <ca7>   DW_AT_data_member_location: 28
 <2><ca8>: Abbrev Number: 1 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0xbc213): hdma
    <cad>   DW_AT_decl_file   : 11
    <cae>   DW_AT_decl_line   : 343
    <cb0>   DW_AT_decl_column : 39
    <cb1>   DW_AT_type        : <0xd02>
    <cb5>   DW_AT_data_member_location: 32
 <2><cb6>: Abbrev Number: 1 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x843a2): Lock
    <cbb>   DW_AT_decl_file   : 11
    <cbc>   DW_AT_decl_line   : 345
    <cbe>   DW_AT_decl_column : 38
    <cbf>   DW_AT_type        : <0x7ac>
    <cc3>   DW_AT_data_member_location: 60
 <2><cc4>: Abbrev Number: 1 (DW_TAG_member)
    <cc5>   DW_AT_name        : (indirect string, offset: 0xbc657): State
    <cc9>   DW_AT_decl_file   : 11
    <cca>   DW_AT_decl_line   : 346
    <ccc>   DW_AT_decl_column : 38
    <ccd>   DW_AT_type        : <0xbd9>
    <cd1>   DW_AT_data_member_location: 61
 <2><cd2>: Abbrev Number: 1 (DW_TAG_member)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xbf6bd): ChannelState
    <cd7>   DW_AT_decl_file   : 11
    <cd8>   DW_AT_decl_line   : 347
    <cda>   DW_AT_decl_column : 38
    <cdb>   DW_AT_type        : <0xd27>
    <cdf>   DW_AT_data_member_location: 62
 <2><ce0>: Abbrev Number: 1 (DW_TAG_member)
    <ce1>   DW_AT_name        : (indirect string, offset: 0xbfcee): ChannelNState
    <ce5>   DW_AT_decl_file   : 11
    <ce6>   DW_AT_decl_line   : 348
    <ce8>   DW_AT_decl_column : 38
    <ce9>   DW_AT_type        : <0xd27>
    <ced>   DW_AT_data_member_location: 66
 <2><cee>: Abbrev Number: 1 (DW_TAG_member)
    <cef>   DW_AT_name        : (indirect string, offset: 0xbf252): DMABurstState
    <cf3>   DW_AT_decl_file   : 11
    <cf4>   DW_AT_decl_line   : 349
    <cf6>   DW_AT_decl_column : 38
    <cf7>   DW_AT_type        : <0xc39>
    <cfb>   DW_AT_data_member_location: 70
 <2><cfc>: Abbrev Number: 0
 <1><cfd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <cfe>   DW_AT_byte_size   : 4
    <cfe>   DW_AT_type        : <0x74a>
 <1><d02>: Abbrev Number: 11 (DW_TAG_array_type)
    <d03>   DW_AT_type        : <0xd12>
    <d07>   DW_AT_sibling     : <0xd12>
 <2><d0b>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <d0c>   DW_AT_type        : <0x306>
    <d10>   DW_AT_upper_bound : 6
 <2><d11>: Abbrev Number: 0
 <1><d12>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d13>   DW_AT_byte_size   : 4
    <d13>   DW_AT_type        : <0xb33>
 <1><d17>: Abbrev Number: 11 (DW_TAG_array_type)
    <d18>   DW_AT_type        : <0xc09>
    <d1c>   DW_AT_sibling     : <0xd27>
 <2><d20>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <d21>   DW_AT_type        : <0x306>
    <d25>   DW_AT_upper_bound : 3
 <2><d26>: Abbrev Number: 0
 <1><d27>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <d28>   DW_AT_type        : <0xd17>
 <1><d2c>: Abbrev Number: 8 (DW_TAG_typedef)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xbb598): TIM_HandleTypeDef
    <d31>   DW_AT_decl_file   : 11
    <d32>   DW_AT_decl_line   : 380
    <d34>   DW_AT_decl_column : 3
    <d35>   DW_AT_type        : <0xc75>
 <1><d39>: Abbrev Number: 4 (DW_TAG_typedef)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x14b2): UBaseType_t
    <d3e>   DW_AT_decl_file   : 12
    <d3f>   DW_AT_decl_line   : 57
    <d40>   DW_AT_decl_column : 23
    <d41>   DW_AT_type        : <0x2ea>
 <1><d45>: Abbrev Number: 4 (DW_TAG_typedef)
    <d46>   DW_AT_name        : (indirect string, offset: 0x668f2): TickType_t
    <d4a>   DW_AT_decl_file   : 12
    <d4b>   DW_AT_decl_line   : 63
    <d4c>   DW_AT_decl_column : 19
    <d4d>   DW_AT_type        : <0x325>
 <1><d51>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d52>   DW_AT_name        : (indirect string, offset: 0x9b48e): xSTATIC_LIST_ITEM
    <d56>   DW_AT_byte_size   : 20
    <d57>   DW_AT_decl_file   : 13
    <d58>   DW_AT_decl_line   : 1061
    <d5a>   DW_AT_decl_column : 8
    <d5b>   DW_AT_sibling     : <0xd7c>
 <2><d5f>: Abbrev Number: 1 (DW_TAG_member)
    <d60>   DW_AT_name        : (indirect string, offset: 0xc0a6a): xDummy2
    <d64>   DW_AT_decl_file   : 13
    <d65>   DW_AT_decl_line   : 1066
    <d67>   DW_AT_decl_column : 13
    <d68>   DW_AT_type        : <0xd45>
    <d6c>   DW_AT_data_member_location: 0
 <2><d6d>: Abbrev Number: 1 (DW_TAG_member)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x4394c): pvDummy3
    <d72>   DW_AT_decl_file   : 13
    <d73>   DW_AT_decl_line   : 1067
    <d75>   DW_AT_decl_column : 8
    <d76>   DW_AT_type        : <0xd7c>
    <d7a>   DW_AT_data_member_location: 4
 <2><d7b>: Abbrev Number: 0
 <1><d7c>: Abbrev Number: 11 (DW_TAG_array_type)
    <d7d>   DW_AT_type        : <0xb1c>
    <d81>   DW_AT_sibling     : <0xd8c>
 <2><d85>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <d86>   DW_AT_type        : <0x306>
    <d8a>   DW_AT_upper_bound : 3
 <2><d8b>: Abbrev Number: 0
 <1><d8c>: Abbrev Number: 8 (DW_TAG_typedef)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x8c453): StaticListItem_t
    <d91>   DW_AT_decl_file   : 13
    <d92>   DW_AT_decl_line   : 1072
    <d94>   DW_AT_decl_column : 34
    <d95>   DW_AT_type        : <0xd51>
 <1><d99>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x6a709): xSTATIC_TCB
    <d9e>   DW_AT_byte_size   : 84
    <d9f>   DW_AT_decl_file   : 13
    <da0>   DW_AT_decl_line   : 1112
    <da2>   DW_AT_decl_column : 16
    <da3>   DW_AT_sibling     : <0xe26>
 <2><da7>: Abbrev Number: 1 (DW_TAG_member)
    <da8>   DW_AT_name        : (indirect string, offset: 0x26a2a): pxDummy1
    <dac>   DW_AT_decl_file   : 13
    <dad>   DW_AT_decl_line   : 1114
    <daf>   DW_AT_decl_column : 11
    <db0>   DW_AT_type        : <0xb1c>
    <db4>   DW_AT_data_member_location: 0
 <2><db5>: Abbrev Number: 1 (DW_TAG_member)
    <db6>   DW_AT_name        : (indirect string, offset: 0x2431f): xDummy3
    <dba>   DW_AT_decl_file   : 13
    <dbb>   DW_AT_decl_line   : 1118
    <dbd>   DW_AT_decl_column : 19
    <dbe>   DW_AT_type        : <0xe26>
    <dc2>   DW_AT_data_member_location: 4
 <2><dc3>: Abbrev Number: 1 (DW_TAG_member)
    <dc4>   DW_AT_name        : (indirect string, offset: 0x1a5ac): uxDummy5
    <dc8>   DW_AT_decl_file   : 13
    <dc9>   DW_AT_decl_line   : 1119
    <dcb>   DW_AT_decl_column : 16
    <dcc>   DW_AT_type        : <0xd39>
    <dd0>   DW_AT_data_member_location: 44
 <2><dd1>: Abbrev Number: 1 (DW_TAG_member)
    <dd2>   DW_AT_name        : (indirect string, offset: 0x26a6d): pxDummy6
    <dd6>   DW_AT_decl_file   : 13
    <dd7>   DW_AT_decl_line   : 1120
    <dd9>   DW_AT_decl_column : 11
    <dda>   DW_AT_type        : <0xb1c>
    <dde>   DW_AT_data_member_location: 48
 <2><ddf>: Abbrev Number: 1 (DW_TAG_member)
    <de0>   DW_AT_name        : (indirect string, offset: 0x424fd): ucDummy7
    <de4>   DW_AT_decl_file   : 13
    <de5>   DW_AT_decl_line   : 1121
    <de7>   DW_AT_decl_column : 13
    <de8>   DW_AT_type        : <0xe36>
    <dec>   DW_AT_data_member_location: 52
 <2><ded>: Abbrev Number: 1 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0x29b88): uxDummy12
    <df2>   DW_AT_decl_file   : 13
    <df3>   DW_AT_decl_line   : 1132
    <df5>   DW_AT_decl_column : 16
    <df6>   DW_AT_type        : <0xe46>
    <dfa>   DW_AT_data_member_location: 68
 <2><dfb>: Abbrev Number: 1 (DW_TAG_member)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x1b8e2): ulDummy18
    <e00>   DW_AT_decl_file   : 13
    <e01>   DW_AT_decl_line   : 1147
    <e03>   DW_AT_decl_column : 14
    <e04>   DW_AT_type        : <0x325>
    <e08>   DW_AT_data_member_location: 76
 <2><e09>: Abbrev Number: 1 (DW_TAG_member)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xb6a1f): ucDummy19
    <e0e>   DW_AT_decl_file   : 13
    <e0f>   DW_AT_decl_line   : 1148
    <e11>   DW_AT_decl_column : 13
    <e12>   DW_AT_type        : <0x30d>
    <e16>   DW_AT_data_member_location: 80
 <2><e17>: Abbrev Number: 1 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0xa812c): uxDummy20
    <e1c>   DW_AT_decl_file   : 13
    <e1d>   DW_AT_decl_line   : 1151
    <e1f>   DW_AT_decl_column : 13
    <e20>   DW_AT_type        : <0x30d>
    <e24>   DW_AT_data_member_location: 81
 <2><e25>: Abbrev Number: 0
 <1><e26>: Abbrev Number: 11 (DW_TAG_array_type)
    <e27>   DW_AT_type        : <0xd8c>
    <e2b>   DW_AT_sibling     : <0xe36>
 <2><e2f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e30>   DW_AT_type        : <0x306>
    <e34>   DW_AT_upper_bound : 1
 <2><e35>: Abbrev Number: 0
 <1><e36>: Abbrev Number: 11 (DW_TAG_array_type)
    <e37>   DW_AT_type        : <0x30d>
    <e3b>   DW_AT_sibling     : <0xe46>
 <2><e3f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e40>   DW_AT_type        : <0x306>
    <e44>   DW_AT_upper_bound : 15
 <2><e45>: Abbrev Number: 0
 <1><e46>: Abbrev Number: 11 (DW_TAG_array_type)
    <e47>   DW_AT_type        : <0xd39>
    <e4b>   DW_AT_sibling     : <0xe56>
 <2><e4f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <e50>   DW_AT_type        : <0x306>
    <e54>   DW_AT_upper_bound : 1
 <2><e55>: Abbrev Number: 0
 <1><e56>: Abbrev Number: 8 (DW_TAG_typedef)
    <e57>   DW_AT_name        : (indirect string, offset: 0x5c1ed): StaticTask_t
    <e5b>   DW_AT_decl_file   : 13
    <e5c>   DW_AT_decl_line   : 1160
    <e5e>   DW_AT_decl_column : 3
    <e5f>   DW_AT_type        : <0xd99>
 <1><e63>: Abbrev Number: 4 (DW_TAG_typedef)
    <e64>   DW_AT_name        : (indirect string, offset: 0xa1803): TaskHandle_t
    <e68>   DW_AT_decl_file   : 14
    <e69>   DW_AT_decl_line   : 70
    <e6a>   DW_AT_decl_column : 37
    <e6b>   DW_AT_type        : <0xe6f>
 <1><e6f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e70>   DW_AT_byte_size   : 4
    <e70>   DW_AT_type        : <0xe74>
 <1><e74>: Abbrev Number: 34 (DW_TAG_structure_type)
    <e75>   DW_AT_name        : (indirect string, offset: 0xbce69): tskTaskControlBlock
    <e79>   DW_AT_declaration : 1
 <1><e79>: Abbrev Number: 10 (DW_TAG_base_type)
    <e7a>   DW_AT_byte_size   : 1
    <e7b>   DW_AT_encoding    : 8	(unsigned char)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x3cb06): char
 <1><e80>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <e81>   DW_AT_encoding    : 5	(signed)
    <e82>   DW_AT_byte_size   : 2
    <e83>   DW_AT_type        : <0x2bd>
    <e87>   DW_AT_decl_file   : 15
    <e88>   DW_AT_decl_line   : 172
    <e89>   DW_AT_decl_column : 15
    <e8a>   DW_AT_sibling     : <0xebf>
 <2><e8e>: Abbrev Number: 23 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0xbcf9e): osPriorityIdle
    <e93>   DW_AT_const_value : -3
 <2><e94>: Abbrev Number: 23 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0xbd18a): osPriorityLow
    <e99>   DW_AT_const_value : -2
 <2><e9a>: Abbrev Number: 23 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0xbd42e): osPriorityBelowNormal
    <e9f>   DW_AT_const_value : -1
 <2><ea0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0xbcc90): osPriorityNormal
    <ea5>   DW_AT_const_value : 0
 <2><ea6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ea7>   DW_AT_name        : (indirect string, offset: 0xbc589): osPriorityAboveNormal
    <eab>   DW_AT_const_value : 1
 <2><eac>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ead>   DW_AT_name        : (indirect string, offset: 0xbaf84): osPriorityHigh
    <eb1>   DW_AT_const_value : 2
 <2><eb2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <eb3>   DW_AT_name        : (indirect string, offset: 0xbd0c6): osPriorityRealtime
    <eb7>   DW_AT_const_value : 3
 <2><eb8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <eb9>   DW_AT_name        : (indirect string, offset: 0xbd01b): osPriorityError
    <ebd>   DW_AT_const_value : 132
 <2><ebe>: Abbrev Number: 0
 <1><ebf>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xc0380): osPriority
    <ec4>   DW_AT_decl_file   : 15
    <ec5>   DW_AT_decl_line   : 181
    <ec6>   DW_AT_decl_column : 3
    <ec7>   DW_AT_type        : <0xe80>
 <1><ecb>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <ecc>   DW_AT_encoding    : 7	(unsigned)
    <ecd>   DW_AT_byte_size   : 4
    <ece>   DW_AT_type        : <0x306>
    <ed2>   DW_AT_decl_file   : 15
    <ed3>   DW_AT_decl_line   : 189
    <ed4>   DW_AT_decl_column : 15
    <ed5>   DW_AT_sibling     : <0xf37>
 <2><ed9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <eda>   DW_AT_name        : (indirect string, offset: 0xbc9f2): osOK
    <ede>   DW_AT_const_value : 0
 <2><edf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ee0>   DW_AT_name        : (indirect string, offset: 0xbc91f): osEventSignal
    <ee4>   DW_AT_const_value : 8
 <2><ee5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ee6>   DW_AT_name        : (indirect string, offset: 0xba92b): osEventMessage
    <eea>   DW_AT_const_value : 16
 <2><eeb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <eec>   DW_AT_name        : (indirect string, offset: 0xbc571): osEventMail
    <ef0>   DW_AT_const_value : 32
 <2><ef1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ef2>   DW_AT_name        : (indirect string, offset: 0xbae6a): osEventTimeout
    <ef6>   DW_AT_const_value : 64
 <2><ef7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ef8>   DW_AT_name        : (indirect string, offset: 0xbb181): osErrorParameter
    <efc>   DW_AT_const_value : 128
 <2><efd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <efe>   DW_AT_name        : (indirect string, offset: 0xbc5d3): osErrorResource
    <f02>   DW_AT_const_value : 129
 <2><f03>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f04>   DW_AT_name        : (indirect string, offset: 0xbc83f): osErrorTimeoutResource
    <f08>   DW_AT_const_value : 193
 <2><f09>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f0a>   DW_AT_name        : (indirect string, offset: 0xbb1bc): osErrorISR
    <f0e>   DW_AT_const_value : 130
 <2><f0f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f10>   DW_AT_name        : (indirect string, offset: 0xbba8f): osErrorISRRecursive
    <f14>   DW_AT_const_value : 131
 <2><f15>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f16>   DW_AT_name        : (indirect string, offset: 0xbd41e): osErrorPriority
    <f1a>   DW_AT_const_value : 132
 <2><f1b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f1c>   DW_AT_name        : (indirect string, offset: 0xbae79): osErrorNoMemory
    <f20>   DW_AT_const_value : 133
 <2><f21>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f22>   DW_AT_name        : (indirect string, offset: 0xbc7e5): osErrorValue
    <f26>   DW_AT_const_value : 134
 <2><f27>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f28>   DW_AT_name        : (indirect string, offset: 0xbbd25): osErrorOS
    <f2c>   DW_AT_const_value : 255
 <2><f2d>: Abbrev Number: 35 (DW_TAG_enumerator)
    <f2e>   DW_AT_name        : (indirect string, offset: 0xbb395): os_status_reserved
    <f32>   DW_AT_const_value : 0x7fffffff
 <2><f36>: Abbrev Number: 0
 <1><f37>: Abbrev Number: 4 (DW_TAG_typedef)
    <f38>   DW_AT_name        : (indirect string, offset: 0xbae61): osStatus
    <f3c>   DW_AT_decl_file   : 15
    <f3d>   DW_AT_decl_line   : 205
    <f3e>   DW_AT_decl_column : 3
    <f3f>   DW_AT_type        : <0xecb>
 <1><f43>: Abbrev Number: 4 (DW_TAG_typedef)
    <f44>   DW_AT_name        : (indirect string, offset: 0xbbbcb): os_pthread
    <f48>   DW_AT_decl_file   : 15
    <f49>   DW_AT_decl_line   : 228
    <f4a>   DW_AT_decl_column : 16
    <f4b>   DW_AT_type        : <0xf4f>
 <1><f4f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f50>   DW_AT_byte_size   : 4
    <f50>   DW_AT_type        : <0xf54>
 <1><f54>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <f55>   DW_AT_prototyped  : 1
    <f55>   DW_AT_sibling     : <0xf5f>
 <2><f59>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f5a>   DW_AT_type        : <0xf5f>
 <2><f5e>: Abbrev Number: 0
 <1><f5f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f60>   DW_AT_byte_size   : 4
    <f60>   DW_AT_type        : <0xf64>
 <1><f64>: Abbrev Number: 36 (DW_TAG_const_type)
 <1><f65>: Abbrev Number: 4 (DW_TAG_typedef)
    <f66>   DW_AT_name        : (indirect string, offset: 0xbaf65): osThreadId
    <f6a>   DW_AT_decl_file   : 15
    <f6b>   DW_AT_decl_line   : 238
    <f6c>   DW_AT_decl_column : 22
    <f6d>   DW_AT_type        : <0xe63>
 <1><f71>: Abbrev Number: 8 (DW_TAG_typedef)
    <f72>   DW_AT_name        : (indirect string, offset: 0xbc442): osStaticThreadDef_t
    <f76>   DW_AT_decl_file   : 15
    <f77>   DW_AT_decl_line   : 267
    <f79>   DW_AT_decl_column : 36
    <f7a>   DW_AT_type        : <0xe56>
 <1><f7e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <f7f>   DW_AT_name        : (indirect string, offset: 0xbb002): os_thread_def
    <f83>   DW_AT_byte_size   : 28
    <f84>   DW_AT_decl_file   : 15
    <f85>   DW_AT_decl_line   : 280
    <f87>   DW_AT_decl_column : 16
    <f88>   DW_AT_sibling     : <0xfef>
 <2><f8c>: Abbrev Number: 1 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xbacdc): name
    <f91>   DW_AT_decl_file   : 15
    <f92>   DW_AT_decl_line   : 281
    <f94>   DW_AT_decl_column : 27
    <f95>   DW_AT_type        : <0xfef>
    <f99>   DW_AT_data_member_location: 0
 <2><f9a>: Abbrev Number: 1 (DW_TAG_member)
    <f9b>   DW_AT_name        : (indirect string, offset: 0xbbbce): pthread
    <f9f>   DW_AT_decl_file   : 15
    <fa0>   DW_AT_decl_line   : 282
    <fa2>   DW_AT_decl_column : 26
    <fa3>   DW_AT_type        : <0xf43>
    <fa7>   DW_AT_data_member_location: 4
 <2><fa8>: Abbrev Number: 1 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xbc8ce): tpriority
    <fad>   DW_AT_decl_file   : 15
    <fae>   DW_AT_decl_line   : 283
    <fb0>   DW_AT_decl_column : 26
    <fb1>   DW_AT_type        : <0xebf>
    <fb5>   DW_AT_data_member_location: 8
 <2><fb6>: Abbrev Number: 1 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0xbb7f7): instances
    <fbb>   DW_AT_decl_file   : 15
    <fbc>   DW_AT_decl_line   : 284
    <fbe>   DW_AT_decl_column : 26
    <fbf>   DW_AT_type        : <0x325>
    <fc3>   DW_AT_data_member_location: 12
 <2><fc4>: Abbrev Number: 1 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0xbac66): stacksize
    <fc9>   DW_AT_decl_file   : 15
    <fca>   DW_AT_decl_line   : 285
    <fcc>   DW_AT_decl_column : 26
    <fcd>   DW_AT_type        : <0x325>
    <fd1>   DW_AT_data_member_location: 16
 <2><fd2>: Abbrev Number: 1 (DW_TAG_member)
    <fd3>   DW_AT_name        : (indirect string, offset: 0xbae53): buffer
    <fd7>   DW_AT_decl_file   : 15
    <fd8>   DW_AT_decl_line   : 287
    <fda>   DW_AT_decl_column : 27
    <fdb>   DW_AT_type        : <0xff4>
    <fdf>   DW_AT_data_member_location: 20
 <2><fe0>: Abbrev Number: 1 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xbb93a): controlblock
    <fe5>   DW_AT_decl_file   : 15
    <fe6>   DW_AT_decl_line   : 288
    <fe8>   DW_AT_decl_column : 27
    <fe9>   DW_AT_type        : <0xff9>
    <fed>   DW_AT_data_member_location: 24
 <2><fee>: Abbrev Number: 0
 <1><fef>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ff0>   DW_AT_byte_size   : 4
    <ff0>   DW_AT_type        : <0xe79>
 <1><ff4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ff5>   DW_AT_byte_size   : 4
    <ff5>   DW_AT_type        : <0x325>
 <1><ff9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ffa>   DW_AT_byte_size   : 4
    <ffa>   DW_AT_type        : <0xf71>
 <1><ffe>: Abbrev Number: 8 (DW_TAG_typedef)
    <fff>   DW_AT_name        : (indirect string, offset: 0xbac58): osThreadDef_t
    <1003>   DW_AT_decl_file   : 15
    <1004>   DW_AT_decl_line   : 290
    <1006>   DW_AT_decl_column : 3
    <1007>   DW_AT_type        : <0xf7e>
 <1><100b>: Abbrev Number: 37 (DW_TAG_const_type)
    <100c>   DW_AT_type        : <0xffe>
 <1><1010>: Abbrev Number: 18 (DW_TAG_variable)
    <1011>   DW_AT_name        : (indirect string, offset: 0xbc57d): task2Handle
    <1015>   DW_AT_decl_file   : 1
    <1015>   DW_AT_decl_line   : 44
    <1016>   DW_AT_decl_column : 12
    <1016>   DW_AT_type        : <0xf65>
    <101a>   DW_AT_external    : 1
    <101a>   DW_AT_location    : 5 byte block: 3 80 2 0 20 	(DW_OP_addr: 20000280)
 <1><1020>: Abbrev Number: 18 (DW_TAG_variable)
    <1021>   DW_AT_name        : (indirect string, offset: 0xbb0ee): task1Handle
    <1025>   DW_AT_decl_file   : 1
    <1025>   DW_AT_decl_line   : 45
    <1026>   DW_AT_decl_column : 12
    <1026>   DW_AT_type        : <0xf65>
    <102a>   DW_AT_external    : 1
    <102a>   DW_AT_location    : 5 byte block: 3 84 2 0 20 	(DW_OP_addr: 20000284)
 <1><1030>: Abbrev Number: 18 (DW_TAG_variable)
    <1031>   DW_AT_name        : (indirect string, offset: 0xbc193): Task03Handle
    <1035>   DW_AT_decl_file   : 1
    <1035>   DW_AT_decl_line   : 46
    <1036>   DW_AT_decl_column : 12
    <1036>   DW_AT_type        : <0xf65>
    <103a>   DW_AT_external    : 1
    <103a>   DW_AT_location    : 5 byte block: 3 88 2 0 20 	(DW_OP_addr: 20000288)
 <1><1040>: Abbrev Number: 18 (DW_TAG_variable)
    <1041>   DW_AT_name        : (indirect string, offset: 0xba941): Task04Handle
    <1045>   DW_AT_decl_file   : 1
    <1045>   DW_AT_decl_line   : 47
    <1046>   DW_AT_decl_column : 12
    <1046>   DW_AT_type        : <0xf65>
    <104a>   DW_AT_external    : 1
    <104a>   DW_AT_location    : 5 byte block: 3 8c 2 0 20 	(DW_OP_addr: 2000028c)
 <1><1050>: Abbrev Number: 38 (DW_TAG_subprogram)
    <1051>   DW_AT_external    : 1
    <1051>   DW_AT_name        : (indirect string, offset: 0xbb526): HAL_IncTick
    <1055>   DW_AT_decl_file   : 16
    <1056>   DW_AT_decl_line   : 232
    <1057>   DW_AT_decl_column : 6
    <1058>   DW_AT_prototyped  : 1
    <1058>   DW_AT_declaration : 1
 <1><1058>: Abbrev Number: 19 (DW_TAG_subprogram)
    <1059>   DW_AT_external    : 1
    <1059>   DW_AT_name        : (indirect string, offset: 0xbd0be): osDelay
    <105d>   DW_AT_decl_file   : 15
    <105e>   DW_AT_decl_line   : 478
    <1060>   DW_AT_decl_column : 10
    <1061>   DW_AT_prototyped  : 1
    <1061>   DW_AT_type        : <0xf37>
    <1065>   DW_AT_declaration : 1
    <1065>   DW_AT_sibling     : <0x106f>
 <2><1069>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <106a>   DW_AT_type        : <0x325>
 <2><106e>: Abbrev Number: 0
 <1><106f>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1070>   DW_AT_external    : 1
    <1070>   DW_AT_name        : (indirect string, offset: 0xbb30c): HAL_GPIO_TogglePin
    <1074>   DW_AT_decl_file   : 9
    <1074>   DW_AT_decl_line   : 236
    <1075>   DW_AT_decl_column : 6
    <1076>   DW_AT_prototyped  : 1
    <1076>   DW_AT_declaration : 1
    <1076>   DW_AT_sibling     : <0x1085>
 <2><107a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <107b>   DW_AT_type        : <0x1085>
 <2><107f>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1080>   DW_AT_type        : <0x319>
 <2><1084>: Abbrev Number: 0
 <1><1085>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1086>   DW_AT_byte_size   : 4
    <1086>   DW_AT_type        : <0x441>
 <1><108a>: Abbrev Number: 24 (DW_TAG_subprogram)
    <108b>   DW_AT_external    : 1
    <108b>   DW_AT_name        : (indirect string, offset: 0xbc2ff): HAL_GPIO_Init
    <108f>   DW_AT_decl_file   : 9
    <108f>   DW_AT_decl_line   : 224
    <1090>   DW_AT_decl_column : 7
    <1091>   DW_AT_prototyped  : 1
    <1091>   DW_AT_declaration : 1
    <1091>   DW_AT_sibling     : <0x10a0>
 <2><1095>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1096>   DW_AT_type        : <0x1085>
 <2><109a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <109b>   DW_AT_type        : <0x10a0>
 <2><109f>: Abbrev Number: 0
 <1><10a0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <10a1>   DW_AT_byte_size   : 4
    <10a1>   DW_AT_type        : <0x92b>
 <1><10a5>: Abbrev Number: 24 (DW_TAG_subprogram)
    <10a6>   DW_AT_external    : 1
